{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Networks Exercise"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": false
   },
   "source": [
    "## Table of Contents\n",
    "\n",
    "- [Introduction](#Introduction)\n",
    "- [Setup](#Setup)\n",
    "\n",
    "    - [Connecting to the Neo4j Database](#Connecting-to-the-Neo4j-Database)\n",
    "    - [Testing our connection](#Testing-our-connection)\n",
    "    \n",
    "- [Brief Overview of Neo4j and Cypher](#Brief-Overview-of-Neo4j-and-Cypher)\n",
    "\n",
    "    - [How Neo4j Works](#How-Neo4j-Works)\n",
    "    - [Components of a Simple Cypher Query](#Components-of-a-Simple-Cypher-Query)\n",
    "    \n",
    "- [Part 1 - Cypher Query Language](#Part-1---Cypher-Query-Language)\n",
    "\n",
    "    - [Exercise - Querying Employee Nodes](#Exercise---Querying-Employee-Nodes)\n",
    "    - [Exercise - The WORKED_WITH relationship](#Exercise---the-WORKED_WITH-relationship)\n",
    "    \n",
    "- [Part 2 - Neo4j and `networkx`](#Part-2---Neo4j-and-networkx)\n",
    "\n",
    "    - [Importing data from Neo4j into `networkx`](#Importing-data-from-Neo4j-into-networkx)\n",
    "    - [Visualizing a Graph in `networkx`](#Visualizing-a-Graph-in-networkx)\n",
    "    - [Creating and Plotting a Subgraph](#Creating-and-Plotting-a-Subgraph)\n",
    "    \n",
    "        - [Exercise - Subsetting a Graph](#Exercise---Subsetting-a-Graph)\n",
    "        \n",
    "- [Part 3 - Analyzing Networks](#Part-3---Analyzing-Networks)\n",
    "\n",
    "    - [Network Measures](#Network-Measures)\n",
    "    - [Exercise - Calculating Network Metrics](#Exercise---Calculating-Network-Metrics)\n",
    "    - [Exercise - Analyzing a Sub Graph](#Exercise---Analyzing-a-Sub-Graph)\n",
    "    - [Plotting Network Metrics](#Plotting-Network-Metrics)\n",
    "    - [Exercise - degree vs. betweeness centrality](#Exercise---degree-vs.-betweeness-centrality)\n",
    "    \n",
    "- [Part 4 - Analyzing Graphs](#Part-4---Analysing-Graphs)\n",
    "\n",
    "    - [Exercise - function that plots centrality metrics](#Exercise---function-that-plots-centrality-metrics)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Introduction\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "This exercise will go over the basics on how to connect to a neo4j database, query the database, and analyse data.  It is broken up into two Jupyter IPython notebooks:\n",
    "\n",
    "- This file, `networks_exercise.ipynb`, contains an exercise you can run through to practice working with Neo4j and `networkx`.\n",
    "- The file `networks_with_neo4j.ipynb`, is the first notebook you should run.  It contains an overview of Neo4j and its Cypher query language, how you interact with Neo4j using Python, and how you analyze networks using the Python `networkx` package.\n",
    "\n",
    "Before you begin this lesson:\n",
    "\n",
    "* Read through and make sure you've followed all the steps in the file README.md inside this exercise's folder.\n",
    "* Read though the \"Installing neo4j\" Guide (either the PDF or the Word Document).\n",
    "* Start your neo4j server using the \"Ne04j Community Edition\" application on your computer (you can confirm it is running by opening [http://localhost:7474/](http://localhost:7474/) - if neo4j is running, you'll either get the \"$\" prompt or be asked to log in.  If neo4j is not running, you'll get an error message indicating the page cannot load).\n",
    "* Work through the `networks_with_neo4j.ipynb` Jupyter IPython notebook, making sure to run all the code cells so you know your software environment is set up and working."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Setup\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "First, we'll import python packages needed for the code in this notebook.  If you stop in the middle of this notebook, close it, then come back later to continue, make sure to run these imports each time you start up the notebook again."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--COMPLETE-- at 2017-05-08 11:27:17.682727\n"
     ]
    }
   ],
   "source": [
    "# Imports \n",
    "import sys\n",
    "\n",
    "# import six for python 2 and 3 support.\n",
    "import six\n",
    "\n",
    "# py2neo - Python package for interacting with neo4j.\n",
    "import py2neo\n",
    "\n",
    "import networkx\n",
    "import numpy\n",
    "import operator \n",
    "import pandas\n",
    "import pprint\n",
    "import pymysql\n",
    "\n",
    "# Allows plots to be showed inline \n",
    "import matplotlib\n",
    "%matplotlib inline\n",
    "\n",
    "import datetime\n",
    "print( \"--COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connecting to the Neo4j Database \n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "To connect to the Neo4j Database we will be using the `py2neo` Python package ( [http://py2neo.org](http://py2neo.org) ).\n",
    "\n",
    "In the cell below we will begin by using `py2neo` to create a connection to our neo4j database. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection to Neo4j at <Graph uri=u'http://localhost:7474/db/data/'> created at 2017-05-08 11:27:20.079080\n"
     ]
    }
   ],
   "source": [
    "# Set up connection to Neo4j local Database \n",
    "# You will need to authenticate your connection, use the next line as an example \n",
    "# authenticate(\"localhost:7474\", \"<YOUR USENAME HERE>, Default is: neo4j\", \"<YOUR_PASSWORD_HERE>\")\n",
    "\n",
    "# set up authentication parameters\n",
    "database_host = \"localhost\"\n",
    "database_port = \"7474\"\n",
    "database_username = \"neo4j\"\n",
    "database_password = \"password\"\n",
    "\n",
    "# authenticate with \"py2neo.authenticate()\" function.\n",
    "py2neo.authenticate( database_host + \":\" + database_port, database_username, database_password )\n",
    "\n",
    "# Create a variable for our graph and print our connection infomation\n",
    "graph_db = py2neo.Graph()\n",
    "print( \"Connection to Neo4j at \" + str( graph_db ) + \" created at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Testing our connection\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "To extract data from our database, we will pass cypher commands Neo4j using the `data()` method on an instance of py2neo's Graph object (more details on this follow).\n",
    "\n",
    "More details on this follow.  First, however, to test our connection, we'll use the `data()` method to run a basic cypher query that asks Neo4j to find all nodes:\n",
    "\n",
    "    MATCH (n)\n",
    "\n",
    "but return only one:\n",
    "\n",
    "    RETURN n limit 1;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'node': (fa07e28:Employee {employeeid:\"90014540\",position:\"FACULTY\"})}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# The syntax below translates to,\n",
    "#'Match (Find) any node, lets call it \"node\", and show me its data. Limit the results to 1'\n",
    "\n",
    "graph_db.data( \"MATCH ( node ) RETURN node limit 1;\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Brief Overview of Neo4j and Cypher\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "### How Neo4j Works\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "When you think of data, you probably imagine an excel table where each row is an individual observation or data point. \n",
    "\n",
    "For example:\n",
    "\n",
    "|name | age | employee_id|\n",
    "|-----|-----|------------|\n",
    "|Joe  |  34 |   12345    |\n",
    "|Ann  |  54 |   12346    |\n",
    "    \n",
    "In Neo4j, each of these rows is stored as and referred to as a Node.  Neo4j nodes can contain all the same information as a tabular representation of data like a spreadsheet or a traditional database table, but they are structured a little differently.\n",
    "\n",
    "A traditional database table will have a set number of columns, and each row in the table will have the same set of columns.  Different types of data are stored in different tables, and rows within a given table can not have different sets of values.\n",
    "\n",
    "In Neo4j (and in other \"NoSQL\" databases that use a record model rather than a relational table model), all things in the system are placed in a single \"Node\" database, and each can have any properties you want to assign to them.\n",
    "\n",
    "So, where a relational database might have separate tables for students and employees, for example, in Neo4j, students and employees are both stored as nodes, and the properties of the node are set as is appropriate for the type of node (so employees have name, age, and an employee ID - just like in the example table above - and students might have name, age, major, expected graduation date, and student ID).\n",
    "\n",
    "You can (and should!) have types of nodes that all are expected to have the same set of properties, but Neo4j and other NoSQL databases do not formally require this like a relational database does when you place data into a table.\n",
    "\n",
    "For example, when you run the following query using py2neo:\n",
    "\n",
    "    MATCH ( n ) RETURN n LIMIT 1;\n",
    "    \n",
    "You get back the following:\n",
    "\n",
    "    [{'n': (b63c693:Employee {employeeid:\"90014540\",position:\"FACULTY\"})}]\n",
    "    \n",
    "OR, formatted more politely:\n",
    "\n",
    "    [\n",
    "        {\n",
    "            'n': (\n",
    "                b63c693 : Employee {\n",
    "                    employeeid:\"90014540\",\n",
    "                    position:\"FACULTY\"\n",
    "                }\n",
    "            )\n",
    "            \n",
    "        }\n",
    "    ]\n",
    "    \n",
    "This structure uses Python (and JSON) conventions for lists and dictionaries to tell you that it returns:\n",
    "\n",
    "- a list ( the outer \"[]\" )\n",
    "- of dictionaries ( the \"{}\" inside the list )\n",
    "- each entry of which contains a mapping of one of the sets of nodes you've requested in RETURN (in this case, 'n')\n",
    "- to a static list (inside the parentheses - \"()\") of the matching nodes that maps IDs (example: `b63c693`) to node properties (`Employee {employeeid:\"90014540\",position:\"FACULTY\"}`).\n",
    "\n",
    "The information about an employee is still there (well, other than the name since we've removed it from our data set...), but instead of storing each peice of information on an employee in a pre-defined column, each employee's information is stored as **properties** on a node, and the type of node is captured as a **label**, *Employee*, associated with the node that identify it as being of type \"Employee\"."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Components of a Simple Cypher Query\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Neo4j uses the Cypher Query Language to get information out of the Database.  The basic syntax is \"`MATCH ( n ) RETURN n LIMIT 1;`\":\n",
    "\n",
    "+ MATCH ( n )\n",
    "\n",
    "    - The `MATCH` clause is essentially the same as the SELECT clause in SQL.  It tells the Cypher query that you are filtering, and the information in parentheses defines where the query will be looking.\n",
    "    - `( n )` tells the Cypher Query to filter and retrieve matches from all nodes.  In `MATCH`, the letter you place here is a name you'll use in subsequent parts of the query to refer to matching nodes (like the `AS` keyword in SQL).  It can be any name, does not need to be `n`.\n",
    "    - Simply placing a name here means it will look at all nodes, regardless of type/label.  To filter on a label, append the label after the name, separated by a colon.  So, for nodes of type \"Employee\", your `MATCH` would look something like: `MATCH ( employees : Employee )`\n",
    "    - You can place more than one type of node inside the parentheses of a `MATCH` clause.\n",
    "\n",
    "+ RETURN n\n",
    "\n",
    "    - The `RETURN` clause tells the Cypher query what information should be returned for matching nodes.\n",
    "    - If you just return the name of the node specified in `MATCH ()`, then it will return all properties for each node.\n",
    "    - You can also specify the names of specific properties of nodes ( \"`RETURN n.employeeid, n.position`\", for example).\n",
    "    - A `RETURN` clause is needed in every query.\n",
    "\n",
    "+ LIMIT 1     \n",
    "\n",
    "    - LIMIT lets you request a subset of all matches be returned (in this case, just 1).  This does not imply order, so you might get a different node each time you run this query.\n",
    "    - This is similar to the LIMIT clause in an SQL statement.\n",
    "    \n",
    "+ all Cypher queries end with a semi-colon ( \";\" ).\n",
    "\n",
    "The following query will return 20 nodes from the database:  \n",
    "\n",
    "    graph_db.data( \"MATCH ( node ) RETURN node LIMIT 20;\" )\n",
    "\n",
    "If I wanted to query just nodes of type \"Award\" (where types are signified by labels associated with nodes), I would add a filter for the label \"Award\" inside the MATCH clause ( `MATCH ( n : Award )` ):  \n",
    "\n",
    "    graph_db.data( \"MATCH ( awards : Award ) RETURN awards LIMIT 20;\" )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'awards.award_num': u'aw1000'},\n",
       " {u'awards.award_num': u'aw1001'},\n",
       " {u'awards.award_num': u'aw1002'},\n",
       " {u'awards.award_num': u'aw1003'},\n",
       " {u'awards.award_num': u'aw1004'},\n",
       " {u'awards.award_num': u'aw1005'},\n",
       " {u'awards.award_num': u'aw1006'},\n",
       " {u'awards.award_num': u'aw1007'},\n",
       " {u'awards.award_num': u'aw1008'},\n",
       " {u'awards.award_num': u'aw1009'},\n",
       " {u'awards.award_num': u'aw1010'},\n",
       " {u'awards.award_num': u'aw1011'},\n",
       " {u'awards.award_num': u'aw1012'},\n",
       " {u'awards.award_num': u'aw1013'},\n",
       " {u'awards.award_num': u'aw1014'},\n",
       " {u'awards.award_num': u'aw1015'},\n",
       " {u'awards.award_num': u'aw1016'},\n",
       " {u'awards.award_num': u'aw1017'},\n",
       " {u'awards.award_num': u'aw1018'},\n",
       " {u'awards.award_num': u'aw1019'}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# You can use this cell to Test the Cypher Queries.  For example, let's try to:\n",
    "# - Match (Find) any nodes that are of type Award\n",
    "# - and show the award number (award_num) for each of the nodes returned,\n",
    "# - limiting the number of results to 20.\n",
    "\n",
    "graph_db.data( \"MATCH ( awards : Award ) RETURN awards.award_num LIMIT 20;\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Cypher Query Language\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "### Exercise - Querying Employee Nodes\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "For our first exercise, write a Cypher query that:\n",
    "\n",
    "- matches nodes of type Employee and returns the employeeid.\n",
    "- Limits the results to 10 nodes.\n",
    "\n",
    "Run the query using your py2neo Graph object's `data()` method and output the results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "nbgrader": {
     "grade": false,
     "grade_id": "squares",
     "locked": false,
     "solution": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'employees.employeeid': u'90014540'},\n",
       " {u'employees.employeeid': u'90026679'},\n",
       " {u'employees.employeeid': u'90017693'},\n",
       " {u'employees.employeeid': u'90028696'},\n",
       " {u'employees.employeeid': u'90013819'},\n",
       " {u'employees.employeeid': u'90001118'},\n",
       " {u'employees.employeeid': u'90001300'},\n",
       " {u'employees.employeeid': u'90023086'},\n",
       " {u'employees.employeeid': u'90017074'},\n",
       " {u'employees.employeeid': u'90025003'}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db.data( \"MATCH ( employees : Employee ) RETURN employees.employeeid LIMIT 10;\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": false
   },
   "source": [
    "Your query should return a list containing dictonaries.\n",
    "\n",
    "Example returned Object from py2neo:\n",
    "\n",
    "    [{u'employees.employeeid': u'90014540'},\n",
    "     {u'employees.employeeid': u'90026679'},\n",
    "     {u'employees.employeeid': u'90017693'},\n",
    "     {u'employees.employeeid': u'90028696'},\n",
    "     {u'employees.employeeid': u'90013819'},\n",
    "     {u'employees.employeeid': u'90001118'},\n",
    "     {u'employees.employeeid': u'90001300'},\n",
    "     {u'employees.employeeid': u'90023086'},\n",
    "     {u'employees.employeeid': u'90017074'},\n",
    "     {u'employees.employeeid': u'90025003'}]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What makes graph databases like Neo4j special is the ability to create relationships between nodes.\n",
    "\n",
    "For instance, the database we created in the first notebook for this exercise has two types of relationships: WORKED_ON and WORKED_WITH\n",
    "\n",
    "+ Employees have a *WORKED_ON* relationship with nodes which represent awards on which the person has worked.   \n",
    "+ Employees have a *WORKED_WITH* relationship other persons that have worked on the same award.   \n",
    "\n",
    "To view what this looks like, this query will return 5 instances of the pattern where an employee worked_on an award, and return the relationship."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'worked_on': (fa07e28)-[:WORKED_ON]->(db59113)},\n",
       " {u'worked_on': (d7f3228)-[:WORKED_ON]->(ba2d86a)},\n",
       " {u'worked_on': (c89b42f)-[:WORKED_ON]->(ee9f6b6)},\n",
       " {u'worked_on': (b4137fe)-[:WORKED_ON]->(b0a9d61)},\n",
       " {u'worked_on': (a9f706b)-[:WORKED_ON]->(cd2ade1)}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# create query string\n",
    "\n",
    "# MATCH clause\n",
    "query_string = \"MATCH ( employee : Employee )\"\n",
    "query_string += \" - [ worked_on : WORKED_ON ] ->\"\n",
    "query_string += \" ( award : Award )\"\n",
    "\n",
    "# RETURN clause\n",
    "query_string += \" RETURN worked_on\"\n",
    "\n",
    "# LIMIT clause\n",
    "query_string += \" LIMIT 5;\"\n",
    "\n",
    "# run the query\n",
    "graph_db.data( query_string )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "### Exercise - the WORKED_WITH relationship\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Write a query that:\n",
    "\n",
    "- matches nodes of type Employee that have a WORKED_WITH relationship with another node of type Employee.\n",
    "- Returns the employeeid of both employee nodes.\n",
    "- Limits the response to 5."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'employee1.employeeid': u'90029620', u'employee2.employeeid': u'90023086'},\n",
       " {u'employee1.employeeid': u'90026012', u'employee2.employeeid': u'90017074'},\n",
       " {u'employee1.employeeid': u'90021622', u'employee2.employeeid': u'90025003'},\n",
       " {u'employee1.employeeid': u'90023237', u'employee2.employeeid': u'90000321'},\n",
       " {u'employee1.employeeid': u'90010462', u'employee2.employeeid': u'90001779'}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# create query string\n",
    "\n",
    "# MATCH clause\n",
    "query_string = \"MATCH ( employee1 : Employee )\"\n",
    "query_string += \" - [ worked_with : WORKED_WITH ] ->\"\n",
    "query_string += \" ( employee2 : Employee )\"\n",
    "\n",
    "# RETURN clause\n",
    "query_string += \" RETURN employee1.employeeid, employee2.employeeid\"\n",
    "\n",
    "# LIMIT clause\n",
    "query_string += \" LIMIT 5;\"\n",
    "\n",
    "# run the query\n",
    "graph_db.data( query_string )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": false,
    "nbgrader": {
     "grade": true,
     "grade_id": "correct_squares",
     "locked": true,
     "points": 1,
     "solution": false
    }
   },
   "source": [
    "Your query should return a list containing dictonaries.\n",
    "\n",
    "    [{u'employee1.employeeid': u'90000919', u'employee2.employeeid': u'90028696'},\n",
    "     {u'employee1.employeeid': u'90024693', u'employee2.employeeid': u'90013819'},\n",
    "     {u'employee1.employeeid': u'90001652', u'employee2.employeeid': u'90001118'},\n",
    "     {u'employee1.employeeid': u'90025754', u'employee2.employeeid': u'90001300'},\n",
    "     {u'employee1.employeeid': u'90004472', u'employee2.employeeid': u'90023086'}]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Part 2 - Neo4j and `networkx `\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Understanding this network would be much easier if we could render charts of it, so we could see the relationships.\n",
    "\n",
    "To do this, we first have to convert our Neo4j data into `networkx` objects.  We can do this using the data that results from one of our Cypher queries.\n",
    "\n",
    "### Importing data from Neo4j into `networkx `\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "First create a query to pull in all of the relations in the system (so not including isolates?)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{u'any_relation': (a21743e)-[:WORKED_ON]->(f6b7edd),\n",
      "  u'node1': (a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}),\n",
      "  u'node2': (f6b7edd:Award {award_num:\"aw1257\"})},\n",
      " {u'any_relation': (a21743e)-[:WORKED_ON]->(a43fe2c),\n",
      "  u'node1': (a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}),\n",
      "  u'node2': (a43fe2c:Award {award_num:\"aw1468\"})}]\n",
      "Relations query --COMPLETE-- at 2017-05-08 11:41:05.351898\n"
     ]
    }
   ],
   "source": [
    "# declare variables - get all relations\n",
    "query_string = \"\"\n",
    "all_graph_data = \"\"\n",
    "\n",
    "# Get ALL the Nodes and relationships \n",
    "# MATCH clause\n",
    "query_string = \"MATCH ( node1 { employeeid: '90024517' } )\"\n",
    "query_string += \" - [ any_relation ] ->\"\n",
    "query_string += \" ( node2 )\"\n",
    "\n",
    "# RETURN clause\n",
    "query_string += \" RETURN node1, any_relation, node2\"\n",
    "\n",
    "# LIMIT clause\n",
    "#query_string += \" LIMIT 5\"\n",
    "\n",
    "# And, the closing semi-colon\n",
    "query_string += \";\"\n",
    "\n",
    "# run the query\n",
    "all_graph_relations = graph_db.data( query_string )\n",
    "\n",
    "pprint.pprint( all_graph_relations )\n",
    "\n",
    "print( \"Relations query --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Next, we'll use the results of this query to make a list of all the employees, students, and awards in our data set."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "label set = set([u'Employee'])\n",
      "====> Employees - unique = 1; total nodes = 2\n",
      "====> Students  - unique = 0; total nodes = 0\n",
      "====> Awards    - unique = 0; total nodes = 0\n",
      "--COMPLETE-- at 2017-05-08 11:40:41.655555\n"
     ]
    }
   ],
   "source": [
    "# The following code is used to keep track of employees vs. students vs. award numbers,\n",
    "\n",
    "# declare variables - make lists of types of nodes.\n",
    "employees = {}\n",
    "awards = {} \n",
    "students = {}\n",
    "label_set = set()\n",
    "relation_spec = None\n",
    "node_1 = None\n",
    "node_2 = None\n",
    "relation = None\n",
    "node_neo4j_id = None\n",
    "node_properties_dict = None\n",
    "node_position = \"\"\n",
    "node_employeeid = \"\"\n",
    "node_award_num = \"\"\n",
    "is_employee = False\n",
    "is_student = False\n",
    "is_award = False\n",
    "employee_id_set = set()\n",
    "student_id_set = set()\n",
    "award_id_set = set()\n",
    "employee_count = 0\n",
    "student_count = 0\n",
    "award_count = 0\n",
    "node_counter = 0\n",
    "test_counter = 0\n",
    "\n",
    "# Loop over all the relations returned by our query.\n",
    "relation_counter = 0\n",
    "for relation_spec in all_graph_relations:\n",
    "\n",
    "    # increment node_counter\n",
    "    node_counter += 1\n",
    "\n",
    "    # initialize\n",
    "    is_employee = False\n",
    "    is_student = False\n",
    "    is_award = False\n",
    "    test_counter = 0\n",
    "    \n",
    "    # get the node1 py2neo Node object for the current relation.\n",
    "    relation = relation_spec[ \"any_relation\" ]\n",
    "    node_1 = relation_spec[ \"node1\" ]\n",
    "    node_2 = relation_spec[ \"node2\" ]\n",
    "    \n",
    "    # get node 1's ID and properties\n",
    "    node_1_neo4j_id = node_1.__name__\n",
    "    node_1_properties_dict = dict( node_1 )\n",
    "    \n",
    "    '''\n",
    "    # Play with the py2neo.Node object.\n",
    "    print( \"======================================\" )\n",
    "    print( \"Current Node ( #\" + str( node_counter ) + \" ) as string: \" + str( node_1 ) )\n",
    "    print( \"- type() of Node: \" + str( type( node_1 ) ) )\n",
    "    print( \"- list of labels: \" + str( node_1.labels() ) )\n",
    "    print( \"- ID of node: \" + str( node_1.__name__ ) )\n",
    "    print( \"- full UUID: \" + str( node_1.__uuid__ ) )\n",
    "    \n",
    "    # print out all of the node Object's properties\n",
    "    print( \"- all Node properties:\" )\n",
    "    for property, value in six.iteritems( vars( node_1 ) ):\n",
    "        print( str( property ) + \" : \" + str( value ) )\n",
    "    '''\n",
    "\n",
    "    \n",
    "    # build list of labels - loop over labels for this node.\n",
    "    node_1_labels = node_1.labels()\n",
    "    for label in node_1_labels:\n",
    "        \n",
    "        # add label to label set.\n",
    "        label_set.add( label )\n",
    "        \n",
    "    #-- END loop over labels --#\n",
    "    \n",
    "    # what type of node?\n",
    "    is_employee = node_1.has_label( \"Employee\" )\n",
    "    is_student = node_1.has_label( \"Student\" )\n",
    "    is_award = node_1.has_label( \"Award\" )\n",
    "    if ( ( is_employee == True ) or ( is_student == True ) ):\n",
    "        \n",
    "        # get person information\n",
    "        node_1_position = node_1_properties_dict.get( \"position\", None )\n",
    "        node_1_employeeid = node_1_properties_dict.get( \"employeeid\", None )\n",
    "        \n",
    "        # employee?\n",
    "        if ( is_employee == True ):\n",
    "            \n",
    "            # employee.  Add to dictionary and set.\n",
    "            employee_count += 1\n",
    "            employee_id_set.add( node_1_employeeid )\n",
    "            employees[ node_1_employeeid ] = node_1_neo4j_id\n",
    "            \n",
    "            # is position other than FACULTY?\n",
    "            if ( node_1_position != \"FACULTY\" ):\n",
    "                \n",
    "                # not Employee, but not FACULTY - error?\n",
    "                print( \"ERROR? - Employee's position is \\\"\" + str( node_1_position ) + \"\\\", not \\\"FACULTY\\\"\" )\n",
    "                \n",
    "            #-- END check to see if position matches node type --#\n",
    "            \n",
    "            test_counter += 1\n",
    "            \n",
    "        #-- END check to see if Employee --#\n",
    "        \n",
    "        # student?\n",
    "        if ( is_student == True ):\n",
    "            \n",
    "            # student.  Add to dictionary and set.\n",
    "            student_count += 1\n",
    "            student_id_set.add( node_1_employeeid )\n",
    "            students[ node_1_employeeid ] = node_1_neo4j_id\n",
    "            \n",
    "            # is position FACULTY?\n",
    "            if ( node_1_position == \"FACULTY\" ):\n",
    "                \n",
    "                # not Employee, but FACULTY - error?\n",
    "                print( \"ERROR? - Student's position is \\\"\" + str( node_1_position ) + \"\\\", should be \\\"STUDENT\\\"\" )\n",
    "                \n",
    "            #-- END check to see if position matches node type --#\n",
    "            \n",
    "            test_counter += 1\n",
    "            \n",
    "        #-- END check to see if Student --#\n",
    "        \n",
    "    elif ( is_award == True ):\n",
    "        \n",
    "        # get award information\n",
    "        node_1_award_num = node_1_properties_dict.get( \"award_num\", None )\n",
    "            \n",
    "        # award.  Add to dictionary and set.\n",
    "        award_count += 1\n",
    "        award_id_set.add( node_1_award_num )\n",
    "        awards[ node_1_award_num ] = node_1_neo4j_id\n",
    "        \n",
    "    #-- END check to see what type --#\n",
    "    \n",
    "    if ( test_counter > 1 ):\n",
    "        \n",
    "        print( \"TEST COUNTER > 1: \" + str( node_1 ) )\n",
    "        \n",
    "#-- END loop over all relations --#\n",
    "\n",
    "print( \"label set = \" + str( label_set ) )\n",
    "print( \"====> Employees - unique = \" + str( len( employee_id_set ) ) + \"; total nodes = \" + str( employee_count ) )\n",
    "print( \"====> Students  - unique = \" + str( len( student_id_set ) ) + \"; total nodes = \" + str( student_count ) )\n",
    "print( \"====> Awards    - unique = \" + str( len( award_id_set ) ) + \"; total nodes = \" + str( award_count ) )\n",
    "\n",
    "print( \"--COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Finally, we'll convert the overall data structure that was returned by our query into a `pandas` DataFrame and import the data into `networkx` from that DataFrame."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "networkx import --COMPLETE-- at 2017-05-08 11:28:07.142898\n"
     ]
    }
   ],
   "source": [
    "# declare variables\n",
    "all_relations_df = None\n",
    "all_relations_nx = None # networkx (nx) representation of graph\n",
    "\n",
    "# Convert all_data to a dataframe object\n",
    "all_relations_df = pandas.DataFrame( all_graph_relations )\n",
    "\n",
    "#print( all_relations_df )\n",
    "\n",
    "# Adding a 'weight' column to see connections better\n",
    "all_relations_df[ 'weight' ] = .01\n",
    "\n",
    "# Use the networkx.from_pandas_dataframe() method to create\n",
    "#     a networkx graph of all the data.\n",
    "#     More info: https://networkx.github.io/documentation/networkx-1.10/reference/generated/networkx.convert_matrix.from_pandas_dataframe.html#from-pandas-dataframe\n",
    "all_relations_nx = networkx.from_pandas_dataframe( all_relations_df, 'node1', 'node2', ['weight'] )\n",
    "\n",
    "print( \"networkx import --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Visualizing a Graph in `networkx`\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Now we will use the `networkx.draw()` function to draw the graph of the network we've created.  First, we will create a function that accepts a list of nodes and creates an associated list of color values for each node."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "def calculate_color_values_for_nodes() --COMPLETE-- at 2017-05-08 11:28:22.321451\n"
     ]
    }
   ],
   "source": [
    "def calculate_color_values_for_nodes( node_list_IN ):\n",
    "\n",
    "    # return reference\n",
    "    color_values_OUT = []\n",
    "    \n",
    "    # declare variables\n",
    "    color_values = []\n",
    "    node_counter = -1\n",
    "    node = None\n",
    "    py2neo_node = None\n",
    "    node_properties_dict = None\n",
    "    node_id = -1\n",
    "    node_type = \"\"\n",
    "    color_value = \"\"\n",
    "    \n",
    "    # loop over nodes\n",
    "    node_counter = 0\n",
    "    for node in node_list_IN:\n",
    "\n",
    "        '''\n",
    "        # Play with the networkx.Node object.\n",
    "        print( \"======================================\" )\n",
    "        print( \"Current Node ( #\" + str( node_counter ) + \" ) as string: \" + str( node ) )\n",
    "        print( \"- type() of Node: \" + str( type( node ) ) )\n",
    "\n",
    "        # print out all of the node Object's properties\n",
    "        print( \"- all Node properties:\" )\n",
    "        for item in node:\n",
    "            print( str( item ) )\n",
    "        '''\n",
    "\n",
    "        # initialize variables\n",
    "        node_id = 0\n",
    "        node_type = None\n",
    "\n",
    "        # get the node's properties (still a reference to py2neo.types.Node)\n",
    "        py2neo_node = node[ 0 ]\n",
    "        node_properties_dict = dict( py2neo_node )\n",
    "\n",
    "        #print( \"node[ 0 ] type = \" + str( type( py2neo_node ) ) )\n",
    "\n",
    "        # Is there an employee ID?\n",
    "        if \"employeeid\" in node_properties_dict:\n",
    "\n",
    "            # yes - store it as ID, and also get position.\n",
    "            node_id = node_properties_dict.get( \"employeeid\", None )\n",
    "            node_type = node_properties_dict.get( \"position\", None )\n",
    "\n",
    "        else:\n",
    "\n",
    "            # no employee ID, so award.\n",
    "            node_id = node_properties_dict.get( \"award_num\", None )\n",
    "            node_type = \"AWARD\"\n",
    "\n",
    "        #-- END check to see if employee ID. --#\n",
    "\n",
    "        # What type?\n",
    "        if node_type == \"FACULTY\":\n",
    "\n",
    "            # FACULTY = green\n",
    "            color_value = 'g'  # green\n",
    "\n",
    "        elif node_type == \"STUDENT\":\n",
    "\n",
    "            # STUDENT = yellow\n",
    "            color_value = 'y'  # yellow\n",
    "\n",
    "        else:\n",
    "\n",
    "            # other = AWARD = red\n",
    "            color_value = 'r'  # red\n",
    "\n",
    "        #-- END check to see what type based on position --#\n",
    "\n",
    "        color_values.append( color_value )\n",
    "\n",
    "    #-- END loop over nodes to derive node colors --#\n",
    "    \n",
    "    # place color values list in return reference.\n",
    "    color_values_OUT = color_values\n",
    "    \n",
    "    return color_values_OUT\n",
    "    \n",
    "#-- END function calculate_color_values_for_nodes() --#\n",
    "\n",
    "print( \"def calculate_color_values_for_nodes() --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "network graphing --COMPLETE-- at 2017-05-08 11:28:26.809523\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/anaconda/lib/python2.7/site-packages/networkx/drawing/nx_pylab.py:126: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  b = plt.ishold()\n",
      "/anaconda/lib/python2.7/site-packages/networkx/drawing/nx_pylab.py:138: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  plt.hold(b)\n",
      "/anaconda/lib/python2.7/site-packages/matplotlib/__init__.py:917: UserWarning: axes.hold is deprecated. Please remove it from your matplotlibrc and/or style files.\n",
      "  warnings.warn(self.msg_depr_set % key)\n",
      "/anaconda/lib/python2.7/site-packages/matplotlib/rcsetup.py:152: UserWarning: axes.hold is deprecated, will be removed in 3.0\n",
      "  warnings.warn(\"axes.hold is deprecated, will be removed in 3.0\")\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAdgAAAFCCAYAAABSJMy8AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3XlwVfX9//EXIQkkAoKCgOw7NyGQhAQE3KiouFQUq3X5\nabXyLei9SQiI8vXr2HEcx2+hUKTaav1StVKHYWxdGC1adEQlQPb1XvZ9D0IC2ZN7z++PFMbTIE3I\nPTl3eT5mmGGEe/LWQZ58PpxzPp0MwzAEAAD8KsLuAQAACEUEFgAACxBYAAAsQGABALAAgQUAwAIE\nFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGABALAA\ngQUAwAIEFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGABALBApN0DAEBIqK+XsrKk8nLJ\n55OuuEK65hqpRw+7J4NNCCwAtMe+fdJrr0l/+pPUqVPzPzOM5u83NkoPPCAtWCCNG2frmOh4nQzD\nMOweAgCCjmFIL74o/eY3zSvWhoYL/7zISCkqSrrvPun//q/5+wgLBBYA2sowpKeekv7yF6mmpnWf\niY2Vpk6V/vGP5ugi5HGTEwC01auvti2uUvPPzcpqDjPCAitYAGiLujqpTx+pqurSPt+1q7RzpzRw\noH/nQsBhBQsAbfHBB+37vGFIf/yjf2ZBQGMFCwBtkZAglZa27xo9e0onTnDDU4hjBQsAreX1SmVl\n7b9OU5O0d2/7r4OARmABoLUqK/2z6uzcWaqoaP91ENAILAC0VnR08zOv7WUYzddCSCOwANBal13W\nvPpsr4YGqW/f9l8HAY3AAkBrderU/Eam9kY2Pl7q398/MyFgEVgAaIuFC+Vtz5uYuneXnn3Wf/Mg\nYBFYAGilAwcO6N6XXtIOn0++cy/2b6vISOnuu/07GAISgQWA/6C+vl4vv/yykpOTNWHCBA3PzVVE\nt25tv1BMjPS3v/H8a5jgjdMAcBGfffaZMjIyFB8fr5ycHA0bNqz5B/75T+mWW5pfmdiaO4tjY6XV\nq6Xp060dGAGDNzkBwAXs3btX8+fPl9vt1sqVK3Xbbbe1/Ek7d0pz50qbN1/4yLrOnZsfxxk7VvrD\nH5oPYEfYYIsYAH6gtrZWL774olJSUjRp0iSVlpZeOK6SNGqU9NVXkscjpac3v8C/W7fmx3n69pV+\n8QspO1vKzyeuYYgVLAD8y7p165SRkaHk5GQtW7ZMQ4YMsXskBDH+DhZA2Nu9e7cyMjK0a9cuvfHG\nG7rlllvsHgkhgC1iAGGrpqZGL7zwgiZPnqzrrrtOxcXFxBV+wwoWQNgxDEMfffSRMjMzNXnyZBUW\nFmogB6DDzwgsgLCyY8cOpaen68CBA1q1apVuuukmu0dCiGKLGEBYqK6u1nPPPaepU6fq5ptvVlFR\nEXGFpQgsgJBmGIY++OADORwO7d+/X8XFxVq4cKGieJsSLMYWMYCQ5fF4lJ6ermPHjum9997TDTfc\nYPdICCOsYAGEnLNnz+qZZ57R9ddfrzvvvFP5+fnEFR2OwAIIGYZhaM2aNYqLi9Px48dVUlKijIwM\ntoNhC7aIAYSEsrIypaWl6dSpU1qzZo2mTZtm90gIc6xgAQS1M2fOaMGCBbrxxhs1e/Zs5ebmElcE\nBAILICgZhqHVq1fL4XCosrJSZWVlcrlcioxkYw6BgV+JAIJOcXGxXC6Xqqur9be//U3XcFINAhAr\nWABBo6KiQhkZGZoxY4YeeughZWdnE1cELAILIOD5fD69++67cjgcqq2tldvt1rx589S5c2e7RwN+\nFFvEAAJaQUGBXC6XGhsb9cknnyg1NdXukYBWYQULICCdPn1aTqdTM2fO1OOPP64tW7YQVwQVAgsg\noPh8Pq1atUoOh0OGYcjj8WjOnDmKiOC3KwQXtogBBIzc3Fw5nU5FRETos88+U3Jyst0jAZeMPxIC\nsN3333+vefPm6c4779S8efO0adMm4oqgR2AB2Mbr9erNN99UXFycoqKi5PF49Pjjj7MdjJDAFjEA\nW2zdulVOp1MxMTH64osvNGHCBLtHAvyKPyYC6FDl5eWaM2eO7rnnHmVkZOibb74hrghJBBZAh/B6\nvXr99dcVHx+v7t27y+Px6JFHHlGnTp3sHg2wBFvEACyXlZUlp9OpHj166Msvv1RCQoLdIwGWI7AA\nLHP8+HE9++yz2rBhg5YuXaoHHniAFSvCBlvEAPyuqalJK1eu1Lhx49SnTx95PB49+OCDxBVhhRUs\nAL/65ptv5HK51KdPH23cuFFxcXF2jwTYgsAC8IujR49q0aJF2rhxo5YtW6b77ruPFSvCGlvEANql\nsbFRy5cvV0JCggYNGiSPx6P777+fuCLssYIFcMm+/vpruVwuDRgwQJs2bdKYMWPsHgkIGAQWQJsd\nPnxYTz/9tLKysvS73/1O99xzDytW4N+wRQyg1RoaGrRkyRJNmDBBI0aMkMfj0ezZs4krcAGsYAG0\nyoYNG5SWlqZhw4Zp8+bNGjVqlN0jAQGNwAK4qIMHD2rBggXKzc3VihUrdNddd7FiBVqBLWIAF1Rf\nX69XXnlFSUlJio+Pl9vt1qxZs4gr0EqsYAG0sH79eqWnp2vs2LHKzs7W8OHD7R4JCDoEFsB5+/bt\nU2ZmpoqLi7Vy5Urdcccddo8EBC22iAGorq5OL730kiZOnKjk5GSVlZURV6CdWMECYe7TTz9VRkaG\nxo8fr7y8PA0dOtTukYCQQGCBMLVnzx7Nnz9f27Zt0+uvv65bb73V7pGAkMIWMRBmamtr9etf/1qp\nqamaMmWKSkpKiCtgAVawQJgwDEOffPKJ5s+fr5SUFBUUFGjw4MF2jwWELAILhIFdu3YpPT1de/fu\n1VtvvaUZM2bYPRIQ8tgiBkJYTU2Nnn/+eV1zzTWaPn26ioqKiCvQQVjBAiHIMAz9/e9/14IFCzR1\n6lQVFRVpwIABdo8FhBUCC4SY7du3Ky0tTYcPH9Y777yj6dOn2z0SEJbYIgZCRFVVlRYvXqxp06Zp\n5syZKiwsJK6AjQgsEOQMw9DatWvlcDh0+PBhlZSUaMGCBYqKirJ7NCCssUUMBDG32620tDSVl5fr\n/fff13XXXWf3SAD+hRUsEITOnj2rp59+WjfccINmzZql/Px84goEGAILBBHDMPT+++/L4XDo5MmT\nKi0tVXp6uiIj2YwCAg3/VwJBorS0VC6XS5WVlVq7dq2mTp1q90gALoIVLBDgKisrNX/+fP3kJz/R\n/fffr9zcXOIKBAECCwQowzD0l7/8RQ6HQ1VVVSorK9NTTz2lzp072z0agFZgixgIQEVFRXI6naqr\nq9OHH36oyZMn2z0SgDZiBQsEkIqKCqWlpemWW27RI488oq1btxJXIEgRWCAA+Hw+vf3223I4HGps\nbJTb7dbcuXPZDgaCGFvEgM3y8/PldDrl8/m0bt06paSk2D0SAD9gBQvY5NSpU3ryySd1++23a86c\nOdq8eTNxBUIIgQU6mM/n01tvvSWHw6HOnTvL7XbriSeeUEQE/zsCoYQtYqAD5eTkyOl0KjIyUuvX\nr1dSUpLdIwGwCH9kBjrAyZMn9atf/Up33XWXnE6nvvvuO+IKhDgCC1jI6/Xqj3/8o+Li4hQTEyOP\nx6Nf/OIXbAcDYYAtYsAiW7ZskdPp1GWXXaYNGzZo/Pjxdo8EoAMRWMDPTpw4ocWLF2v9+vVaunSp\nHnroIXXq1MnusQB0MPapAD9pamrSa6+9pvj4ePXq1Uvbtm3Tww8/TFyBMMUKFvCD7777Ti6XS716\n9dLXX3+t+Ph4u0cCYDMCC7TDsWPH9Mwzz+irr77Sb3/7W/385z9nxQpAElvEwCVpamrSihUrlJCQ\noH79+snj8eiBBx4grgDOYwULtNHGjRvlcrnUr18/ffvttxo7dqzdIwEIQAQWaKUjR45o0aJF+vbb\nb7V8+XLde++9rFgB/Ci2iIH/oLGxUcuWLdP48eM1ZMgQeTwe/exnPyOuAC6KFSxwEV999ZVcLpcG\nDx6srKwsjR492u6RAAQJAgtcwKFDh7Rw4UJt3bpVK1as0KxZs1ixAmgTtoiBH2hoaNBvfvMbJSYm\nasyYMXK73br77ruJK4A2YwUL/MsXX3yhtLQ0jRo1Slu2bNHIkSPtHglAECOwCHsHDhxQZmamCgoK\n9Oqrr+qnP/2p3SMBCAFsESNs1dfX6+WXX1ZycrImTJigsrIy4grAb1jBIiz94x//UHp6uuLj45WT\nk6Nhw4bZPRKAEENgEVb27t2rzMxMlZWV6dVXX9Xtt99u90gAQhRbxAgLtbW1evHFF5WSkqLU1FSV\nlJQQVwCWYgWLkLdu3TplZGQoKSlJ+fn5GjJkiN0jAQgDBBYha/fu3crIyNDOnTv1xhtv6JZbbrF7\nJABhhC1ihJyamhq98MILmjx5sq677jqVlJQQVwAdjhUsQoZhGProo4+UmZmpyZMnq7CwUAMHDrR7\nLABhisAiJOzYsUPp6ek6cOCAVq1apZtuusnukQCEObaIEdSqq6v13HPPaerUqZoxY4YKCwuJK4CA\nQGARlAzD0AcffCCHw6H9+/eruLhYTz/9tKKjo+0eDQAksUWMILRt2zalpaXp2LFjeu+993TDDTfY\nPRIAtMAKFkHj7NmzeuaZZ3TttdfqjjvuUH5+PnEFELAILAKeYRhas2aNHA6Hjh07ptLSUs2fP19R\nUVF2jwYAP4otYgS0srIypaWl6dSpU1qzZo2uvfZau0cCgFZhBYuAdObMGS1cuFA33nijZs+erdzc\nXOIKIKgQWAQUwzC0evVqORwOnT59WmVlZXK5XIqMZLMFQHDhdy0EjOLiYrlcLlVXV+uDDz7QlClT\n7B4JAC4ZK1jYrqKiQhkZGZoxY4YefPBBZWdnE1cAQY/AwjY+n0/vvvuuHA6Hamtr5Xa79eSTT6pz\n5852jwYA7cYWMWxRUFAgl8ulxsZGffzxx5o0aZLdIwGAX7GCRYc6ffq0nE6nZs6cqccee0xbtmwh\nrgBCEoFFh/D5fFq1apUcDod8Pp88Ho/+67/+SxER/BIEEJrYIoblcnNz5XK5JEmffvqpJk6caPNE\nAGA9lg+wzPfff6958+bpzjvv1Ny5c5WVlUVcAYQNAgu/83q9evPNNxUXF6eoqCh5PB49/vjjbAcD\nCCtsEcOvtm7dKpfLpS5duujzzz9XYmKi3SMBgC1YUsAvysvLNWfOHN1zzz1KS0vTt99+S1wBhDUC\ni3bxer16/fXXFR8fr+7du8vj8ejRRx9Vp06d7B4NAGzFFjEuWVZWlpxOp3r06KEvv/xSCQkJdo8E\nAAGDwKLNjh8/rmeffVb//Oc/tXTpUj344IOsWAHg37BFjFZramrSypUrNW7cOPXu3Vsej0cPPfQQ\ncQWAC2AFi1b55ptv5HK51Lt3b23cuFFxcXF2jwQAAY3A4qKOHj2qRYsWaePGjVq2bJnuu+8+VqwA\n0ApsEeOCGhsbtXz5ciUkJGjgwIHyeDy6//77iSsAtBIrWLTw9ddfy+Vy6eqrr9amTZs0ZswYu0cC\ngKBDYHHe4cOH9fTTTysrK0vLly/X7NmzWbECwCViixhqaGjQ0qVLNWHCBI0YMUJut1v33nsvcQWA\ndmAFG+Y2bNigtLQ0DRs2TJs3b9aoUaPsHgkAQgKBDVMHDx7UggULlJubqxUrVuiuu+5ixQoAfsQW\ncZipr6/XK6+8osTERMXFxcntdmvWrFnEFQD8jBVsGPn888+VlpamsWPHKjs7WyNGjLB7JAAIWQQ2\nDOzbt0+ZmZkqLi7WypUrdccdd9g9EgCEPLaIQ1hdXZ1eeuklTZw4UcnJySorKyOuANBBWMGGqE8/\n/VQZGRlKSEhQXl6ehg4davdIABBWCGyI2bNnj+bPn69t27bptdde08yZM+0eCQDCElvEIaK2tla/\n/vWvlZqaqilTpqikpIS4AoCNWMEGOcMw9Mknn2j+/PlKSUlRQUGBBg8ebPdYABD2CGwQ27Vrl9LT\n07Vnzx796U9/0s0332z3SACAf2GLOAjV1NTo+eef1zXXXKMbb7xRxcXFxBUAAgwr2CBiGIY+/PBD\nZWZmasqUKSosLNTAgQPtHgsAcAEENkhs375d6enpOnTokN555x1Nnz7d7pEAABfBFnGAq6qq0uLF\nizVt2jTdeuutKiwsJK4AEAQIbIAyDENr166Vw+HQoUOHVFJSogULFigqKsru0QAArcAWcQDyeDxy\nuVwqLy/XX//6V11//fV2jwQAaCNWsAHk7NmzWrRoka6//nrNmjVL+fn5xBUAghSBDQCGYej999/X\n2LFjVV5ertLSUqWnpysykg0GAAhW/A5us9LSUrlcLlVWVmrt2rWaNm2a3SMBAPyAFaxNKisrlZmZ\nqenTp+u+++5Tbm4ucQWAEEJgO5hhGHrvvffkcDh09uxZud1uOZ1Ode7c2e7RAAB+xBZxByoqKpLT\n6VRdXZ0+/PBDTZ482e6RAAAWYQXbASoqKpSWlqabb75ZjzzyiLZu3UpcASDEEVgL+Xw+vf3223I4\nHGpoaJDH49HcuXPZDgaAMMAWsUXy8/PldDrl8/m0bt06paSk2D0SAKADsYL1s1OnTunJJ5/Ubbfd\npieeeEKbN28mrgAQhgisn/h8Pr311ltyOByKiIiQx+PRnDlzFBHBf2IACEdhv0VsGIY27t+o/KP5\nOl17WrFRsRrYY6DuHnu3unfp3qpr5OTkyOl0KjIyUuvXr1dSUpLFUwMAAl0nwzAMu4ewQ2Vdpd4t\neldLs5aqoq5C9U31avQ1qnOnzoqJipHX59WD4x7UgikLFH9V/AWvcfLkST333HNat26dXnnlFT36\n6KOsWAEAksJ0i7jsRJlG/X6U/vvL/9ahM4dU1VClRl+jJMlreFXVUKXaplq9W/SuUt9K1YotK0yf\n93q9euONNxQXF6eYmBh5PB499thjxBUAcF7YbRG7y92a+uepOlt/VoYuvnj3Gl7VNtXqf776H1U1\nVOn565/Xli1b5HQ6FRsbqw0bNmj8+PEdNDkAIJiE1RZxdUO1hq8crvLq8v8Y138XExmjaUemqezD\nMi1ZskQPP/ywOnXqZNGkAIBgF1Yr2NXFq1XdUN3muEpSbVOtCq4s0J5te9SjRw8LpgMAhJKw+UtD\nwzC0ZNMSVTdWX/I1arvWak/NHj9OBQAIVWET2K2Ht+p49fF2XaO+qV6/2/I7P00EAAhlYRPYomNF\n8hm+dl3Da3iVezjXTxMBAEJZ2AS2sr7y/KM47XGm4YwfpgEAhLqwCWxsVKwiI9p/T1eXiC5+mAYA\nEOrC5i7iIZcPUVRElOpU167r7C3Yq7i4OKWmpp7/NmHCBHXt2tVPkwIAQkHYPAfb4G3QVUuvUmV9\n5SVfo3t0d71393sa2jBUOTk5ys7OVk5OjrZv394iunFxcZz7CgBhLGwCK0mLNyzWii0rVO+tv6TP\n947trWMLj6lzhDmctbW1KiwsNEX3yJEjSkxM1KRJk85Hd/jw4bycAgDCRFgF9mDlQY15bYxqm2rb\n/NnYqFi9cP0LevbaZ1v18ysqKpSXl6ecnJzz4a2pqVFKSoopuv3792/zLACAwBdWgZWkNaVr9MuP\nf9mmyHaN7Kppg6bp8//3eYvVa1scO3bsfHDPRTcmJkapqanno5uSkqKePXte8tcAAASGsAusJL1d\n8LacnzlbFdnYqFhNGzRNHz3wkWKjYv06h2EY2rt3rym6+fn56t+///kV7qRJk5SYmKjYWP9+bQCA\ntcIysJKUdTBLz3/1vDYf2iyf4VODt8H0492iu6lHdA8tmrZIaZPS2rVybQuv1yuPx2OKbllZmUaP\nHm2Kbnx8vKKiojpkJgBA24VtYM/ZV7FPr2e/ru8OfKeK+grFRMZoaM+heir1Kf1k2E8U0cn+R4Xr\n6+tVVFRkiu7+/fs1fvx4053Lo0aN4kxaAAgQYR/YYHX27Fnl5+efv2s5JydHFRUVmjhxoim6AwcO\n5M5lALABgQ0h5eXlys3NNUU3IiLCFNzU1FRdeeWVdo8KACGPwIYwwzB08OBB0/O5eXl5uvLKK02P\nCiUnJ6tbt252jwsAIYXAhhmfz6cdO3aYoltSUqJhw4aZojt+/HhFR0fbPS4ABC0CCzU0NKi0tNT0\nfO7u3bsVHx9viu6YMWN4/SMAtBKBxQVVV1eroKDAFN0TJ04oOTnZ9GKMIUOGcBMVAFwAgUWrnTp1\nSrm5uaboNjY2mp7PTU1N1VVXXWX3qABgOwKLdjl8+LDp+dzc3Fx1797ddNdySkqKevToYfeoANCh\nCCz8yjAM7d692/SoUGFhoQYNGmSKbmJiImfoAghpBBaWa2pqktvtNkV3+/btGjt2bIszdCMjI+0e\nFwD8gsDCFrW1tSoqKjJF99ChQ0pKSjJFd8SIEdxEBSAoEVgEjMrKSuXl5ZmiW1VV1eJNVFdffbXd\nowLAf0RgEdCOHz9uums5JydHXbp0MT2fm5KSol69etk9KgCYEFgEFcMwtG/fPlN08/Pz1a9fP1N0\nk5KSOEMXgK0ILIKe1+vVtm3bTNF1u90aOXKk6fnccePGcYYugA5DYBGS6uvrVVxcbHpGd9++fUpI\nSDC9GIMzdAFYhcAibJw7Q/eH0T116pTpDN1JkyZxhi4AvyCwCGsnT540BTcnJ0eSWty53Lt3b5sn\nBRBsCCzwA4Zh6NChQ6ZHhfLy8nTFFVeYgjtx4kTO0AVwUQQW+A98Pp927txpim5xcbGGDRtmiu74\n8ePVpUsXu8cFECAILHAJGhsbz5+hey68u3btUnx8vCm6Y8eO5QxdIEwRWMBPampqzp+hey66x48f\nP3+G7rlvQ4cO5SYqIAwQWMBCp0+fbnGGbkNDg1JSUkwvxujbt6/dowLwMwILdLAjR460uHO5W7du\npkeFJk6cqMsvv9zuUQG0A4EFbHbuDN0fBrewsFADBgwwRZczdIHgQmCBAHTuDN0fRnfbtm0aM2aM\nKbqcoQsELgILBIm6ujoVFhaaonvw4EElJiaabqIaOXIkN1EBAYDAAkHs3Bm6P4zu2bNnlZKSYoru\ngAED7B4VCDsEFggxx48fV25urunFGNHR0abgpqSk6IorrrB7VCCkEVggxBmGof3795uez83Pz1ff\nvn1N0U1KStJll11m97hAyCCwQBjyer3avn276fncsrIyjRgxwvR8bkJCAmfoApeIwAKQ1HyGbklJ\nienvc/fs2XP+DN1z4R09ejRn6AKtQGAB/KiqqqoWZ+iePHny/Bm656I7aNAg7lwG/g2BBdAmJ0+e\nbPH6R8MwTM/ncoYuQGABtNO5M3R/uMrNzc1Vr169Wpyh2717d7vHBToMgQXgd+fO0P1hdIuLizVk\nyBBTdCdMmMAZughZBBZAh2hsbFRZWZnp+dydO3cqLi7OFF2Hw8EZuggJBBaAbWpqas6//vFceI8e\nPdriDN1hw4ZxExWCDoEFEFBOnz59/vWP56JbV1dnCm5qaqr69etn96jARRFYAAHv6NGjpruWc3Nz\nFRsba7prOSUlhTN0EVAILICgYxiG9uzZY7qJqqCgQFdffbUpuomJiYqJibF7XIQpAgsgJDQ1Ncnj\n8Zii63a7z5+hey668fHxnKGLDkFgAYSsuro6FRUVmaJ74MABTZgwwfRiDM7QhRUILICwcubMmRZn\n6FZWVprO0J00aRJn6KLdCCyAsHfixAlTcHNychQZGdnizmXO0EVbEFgA+DeGYejAgQOmR4Xy8vJ0\n1VVXmYKbnJzMGbr4UQQWAFrB5/OdP0P3XHRLS0s1YsQIU3QTEhIUHR1t97gIAAQWAC5RQ0PD+TN0\nz0V3z549GjdunOng+jFjxnCGbhgisADgR1VVVSooKDC9GOPkyZNKTk42RXfw4MHcuRziCCwAWOz7\n779vcYau1+s1PZ+bmpqqPn362D0q/IjAAkAHMwxDhw8fbnHncs+ePU2PCnGGbnAjsAAQAHw+n3bt\n2mUKblFRkQYPHtziDN2uXbvaPS5agcACQIA6d4buD6O7Y8cOORwOU3Tj4uI4QzcAEVgACCK1tbUq\nLCw0HVx/5MgRJSUlmaI7fPhwbqKyGYEFgCBXUVGhvLw8U3Rra2tNr39MTU1V//797R41rBBYAAhB\nx44dMz2fm5OTo5iYGNNdyykpKerZs6fdo7Z07JhUVCRVVkpdu0oDBkjJyVKQrcgJLACEAcMwtHfv\nXtOjQgUFBerfv78puklJSfacoWsY0jffSEuXShs2NIfV52uOqs8nXXGFtGiR9OijUo8eHT/fJSCw\nABCmvF6v6Qzd7Oxsud1ujR492hTd+Ph4RUVFWTfIqVPSbbdJbrdUXd0c2ws5997ntWul22+3bh4/\nIbAAgPPq6+tNZ+hmZ2frwIEDGj9+vOnFGCNHjvTP6x+//15KSZGOHJEaGlr3mZgY6c9/lh54oP1f\n30IEFgBwUWfOnFF+fr7pcaGKigpNnDixxRm6bbpz2euVUlOlsrLWx/WcmBjpyy+lKVPa9rkORGAB\nAG1WXl7e4k1UERERLc7QvfLKK3/8IuvWSQ89JFVVXdoQU6dKmzZd2mc7AIEFALSbYRg6ePCg6a7l\nvLw89e7du8UZut26dWv+0LXXti+QXbtKJSXSyJH++ZfwMwILALCEz+fTjh07TNEtKSnR8OHDdfuY\nMXr5448V2dR06V8gKkqaO1f6/e/9N7QfEVgAQIdpaGhQaWmpTv/+95q6erVi2hNYSRozRtq2zT/D\n+RknAAMAOkx0dLSSk5N1U3KyYvzx/uTKyvZfwyIEFgDQ8aKiJH885mPl87ntRGABAB2vb18pMtI/\n1wlQBBYA0PFuvbX5Odj26NZN+tWv/DOPBQgsAKDjxcZKjz3Wvi1en6/5OdoARWABAPbIyJAu9Uan\nLl2aX/x/7v3EAYjAAgDsMXq09MILzavZtujcufkIu//9X2vm8hMCCwCwz+LFktPZ+shGR0uDBjUf\nbXf55dbO1k4EFgBgn06dpCVLpD/8Qerfv/nGpQuJiWl+NeK990oFBc0r2ADHm5wAAIHB52s+bH3J\nEik/v/msJ+JMAAAA7ElEQVRs2OhoqU8f6cknpV/+UrrY4QEBhsACAGABtogBALAAgQUAwAIEFgAA\nCxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGABALAAgQUA\nwAIEFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGAB\nALAAgQUAwAIEFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBYAAAsQGABALAAgQUAwAIEFgAACxBY\nAAAsQGABALAAgQUAwAIEFgAAC/x/XkIxvewXR8AAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x116520bd0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# visualize the network       \n",
    "\n",
    "# declare variables\n",
    "all_relations_nodes = None\n",
    "color_values = []\n",
    "\n",
    "# use networkx graph.nodes() method to retrieve just list of nodes\n",
    "all_relations_nodes = all_relations_nx.nodes( data = True )\n",
    "\n",
    "# get colors of nodes.\n",
    "color_values = calculate_color_values_for_nodes( all_relations_nodes )\n",
    "        \n",
    "# output_graph\n",
    "networkx.draw( all_relations_nx, node_color = color_values )\n",
    "\n",
    "print( \"network graphing --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Admittently, this is not the most informative graph.  There are too many nodes and connections to be able to see any patterners or insigths in the dataset. At best, you might be able to get a rough idea of the relative proportions of employee, award and student nodes (which is not in itself particularly useful since the ties are of different types)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creating and Plotting a Subgraph\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "We just created a plot of all the Employees, Students, and Awards that are a part of any relationship in our graph database.  Now let's practice plotting subgraphs.\n",
    "\n",
    "To start, here is an example of a Cypher query to filter nodes based on values of properties within the node.  This query retrieves the Node for a particular employee of interest, that with the employeeid of \"90022882\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'e': (d834d96:Employee {employeeid:\"90022882\",position:\"FACULTY\"})}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# This is the employee id of an employee I would like to search for. It is saved into a variable, employee_id_parameter \n",
    "employee_id_parameter = '90022882'\n",
    "\n",
    "# This Cypher query searches for an employee where the employee id is provided by the parameter, employee_id_parameter \n",
    "# This query translates to,\n",
    "# Find the Node of type Employee where the employee id is equal to the value in the\n",
    "# variable employee_id_parameter. Return that nodes data.\n",
    "\n",
    "query_string = \"MATCH (e:Employee {employeeid: '\"\n",
    "query_string += employee_id_parameter\n",
    "query_string += \"'}) RETURN e;\"\n",
    "\n",
    "graph_db.data( query_string ) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Exercise - Subsetting a Graph\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Write a function that:\n",
    "\n",
    "- accepts a specific award number.\n",
    "- finds all the Employees/Students who worked on that award.\n",
    "- plots the graph.\n",
    "- returns this subgraph as a networkx graph object instance.\n",
    "\n",
    "**_Hints_**:\n",
    "- The folowing Cypher query returns the employees and student who worked on the award 'aw1006'\n",
    "\n",
    "        MATCH (n) -[r:WORKED_ON] -> (a:Award {award_num:'aw1006'}) RETURN n,r\n",
    "\n",
    "- see example above for how to include a variable value in a Cypher Query string."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  award_award_num person_node_employeeid person_node_position\n",
      "0          aw1501               90028906              FACULTY\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<networkx.classes.graph.Graph at 0x116535f10>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAdgAAAFCCAYAAABSJMy8AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHjNJREFUeJzt3Xl01OWhxvHnh6CYhX2JEHYI20wyCSHsi5RF0FARUVBp\ndSaLoFJbL0Vba6miCAKCoEBIptV6rOVCkX3fwiJhyzbFBUVUarmlVlqRQBZy/+Bej7YukMwv7yzf\nzzkczoHM7zz/Ped5ZzKvVVlZWSkAAOBXtUwHAAAgFFGwAADYgIIFAMAGFCwAADagYAEAsAEFCwCA\nDShYAABsQMECAGADChYAABtQsAAA2ICCBQDABhQsAAA2oGABALABBQsAgA0oWAAAbEDBAgBgAwoW\nAAAbULAAANiAggUAwAYULAAANqBgAQCwAQULAIANKFgAAGxAwQIAYAMKFgAAG1CwAADYgIIFAMAG\n4V2wly5JmzdLQ4dKjRpJdetK0dFSx47S/PnS2bOmEwIAgpRVWVlZaTqEEb/9rfSLX0jnzl3+8+8i\nIi4X8B13SAsXSvXq1XxGAEDQCr+CrayUfvYzKStLOn/++3/+uuukVq2kPXukmBj78wEAQkL4HRE/\n9dSVl6skXbwonTwpDR78zUsXAIBvEF4L9s9/lnr2lEpKrv61110nTZokPf+8/3MBAEJOeC3Y55+X\nSkur9tqLF6XsbOnCBf9mAgCEpPAp2M8/l157TaqoqN5z/vu//ZMHABDSwqdgN2yQateu3jPOnZOW\nLvVPHgBASAufgj19uurHw1/1179W/xkAgJAXPgVbVnb591r98RwAAL5H+BRsgwZSnTrVf079+tV/\nBgAg5IVPwfbrd/lLJqrj2mul4cP9kwcAENLC6/dge/aUDh+u+uvr1pXeektq29ZvkQAAoSl8Fqwk\nTZsmRUVV+eV/79iRcgUAXJHwKtgf/lBq06ZK78VWXHed0j/7THfffbf+/ve/2xAOABBKwqtg69SR\nduyQmje/upK9/npd8/vf69V33lHz5s3ldDq1fPlyhdPpOgDg6oTXe7D/78yZyx9Weu+97/4C/8jI\ny3+vXCmNGPHlPx84cEBut1udO3fWSy+9pBtuuMHmwACAYBNeC/b/NW0qHT0qrV59uTjr1r386zfR\n0ZfvfY2MvHyUPGuW9MknXytXSerdu7fy8/PlcDiUkJCg3/72t6xZAMDXhOeC/XeffCIVF0uffXb5\novWWLaWkJMmyvvelBQUFcrvdatq0qbKystSmTZsaCAwACHQUrB+UlZVpzpw5mjdvnqZPn65Jkyap\nVq3wPBwAAFxGwfrR22+/LY/Ho2uuuUbZ2dmKi4szHQkAYAgzy4+6dOmi3Nxc3X777erXr5+ee+45\nlZeXm44FADCABWuTEydOKCMjQ//85z/l9XrldDpNRwIA1CAWrE3at2+vrVu3KjMzU0OGDNH06dNV\n6o/r8gAAQYGCtZFlWUpLS1N+fr6OHDmi5ORkHTp0yHQsAEANoGBrQGxsrNasWaNHH31Uqamp+vnP\nf66SkhLTsQAANqJga4hlWbrrrrtUVFSkjz76SAkJCdqzZ4/pWAAAm/AhJ0PeeOMNPfDAAxozZoxm\nzpyp6Oho05EAAH7EgjXk1ltvlc/n0/nz5+V0OrVlyxbTkQAAfsSCDQBbtmxRRkaGbrzxRs2bN08N\nGzY0HQkAUE0s2AAwfPhwFRcXKzIyUg6HQ6tWrTIdCQBQTSzYALNnzx55PB4lJiZq4cKFatasmelI\nAIAqYMEGmAEDBqiwsFBt27ZVfHy8XnvtNa7CA4AgxIINYIcPH5bb7VabNm20ZMkStWzZ0nQkAMAV\nYsEGsOTkZB0+fFjJyclyuVxatmwZaxYAggQLNkj4fD653W5FR0dr2bJlat++velIAIDvwIINEg6H\nQ/v379fIkSOVkpKiBQsWqKKiwnQsAMC3YMEGoXfffVdpaWkqLy9XTk6OunbtajoSAODfsGCDUFxc\nnHbt2qV77rlHAwYM0DPPPKOysjLTsQAAX8GCDXIffvihMjIydObMGXm9XrlcLtORAABiwQa9Nm3a\naNOmTZoyZYqGDx+uxx9/XBcvXjQdCwDCHgUbAizL0r333qvCwkIdO3ZMiYmJOnDggOlYABDWOCIO\nMZWVlVqxYoWmTJmi8ePHa8aMGYqMjDQdCwDCDgs2xFiWpXHjxqm4uFhnzpxRfHy8du7caToWAIQd\nFmyIW79+ve6//36NGjVKs2fPVv369U1HAoCwwIINcTfffLN8Pp+ky19WsX79esOJACA8sGDDyI4d\nO5Senq6+fftq/vz5aty4selIABCyWLBhZMiQISoqKlKTJk3kdDq1YsUK05EAIGSxYMPUm2++KY/H\no65du+rFF19UTEyM6UgAEFJYsGGqT58+Onr0qLp27aqEhAS9/PLLXIUHAH7EgoXy8/PldrsVExOj\npUuXqnXr1qYjAUDQY8FCiYmJOnjwoPr3768ePXpo8eLFunTpkulYABDUWLD4mmPHjsnj8ejaa69V\ndna2OnXqZDoSAAQlFiy+plu3btq7d6/GjBmjPn36aM6cOVzsDgBVwILFt3r//feVnp6uc+fOyev1\nyuFwmI4EAEGDBYtv1aFDB23fvl1paWm68cYb9eSTT6q0tNR0LAAIChQsvpNlWcrIyFB+fr4OHjyo\n5ORkHT582HQsAAh4FCyuSGxsrNauXatp06bp5ptv1rRp01RSUmI6FgAELAoWV8yyLN19990qKirS\nBx98IJfLpb1795qOBQABiQ85ocpWrVqlBx98ULfddptmzpypqKgo05EAIGCwYFFlY8aMkc/n07lz\n5+R0OrV161bTkQAgYLBg4RebN29WRkaGhg4dqrlz56pBgwamIwGAUSxY+MWIESPk8/lUt25dORwO\nrV692nQkADCKBQu/y83NlcfjUXJysl544QU1bdrUdCQAqHEsWPjdwIEDVVhYqNjYWDmdTv3hD3/g\nKjwAYYcFC1sdPHhQbrdb7du31+LFi9WyZUvTkQCgRrBgYauUlBQdOXJEiYmJcrlcys7OZs0CCAss\nWNSYoqIiud1uNWzYUFlZWWrXrp3pSABgGxYsakx8fLwOHDigYcOGqWfPnnrhhRe42B1AyGLBwoh3\n331XHo9Hly5dUk5Ojrp06WI6EgD4FQsWRsTFxWn37t2aMGGC+vfvr2effVbl5eWmYwGA37BgYdzJ\nkyeVkZGhTz/9VF6vVwkJCaYjAUC1sWBhXNu2bbV582Y9+OCDGjZsmJ544gldvHjRdCwAqBYKFgHB\nsizdd999KigoUFFRkZKSkpSXl2c6FgBUGUfECDiVlZVavny5Hn74Yd1111166qmnFBERYToWAFwV\nFiwCjmVZuvPOO1VcXKzTp08rISFBu3fvNh0LAK4KCxYBb+3atZo0aZJSU1M1a9Ys1atXz3QkAPhe\nLFgEvNTUVPl8PpWXl8vhcGjjxo2mIwHA92LBIqhs27ZN6enpGjBggObPn69GjRqZjgQA34gFi6Ay\ndOhQFRcXq2HDhnI4HFq5cqXpSADwjViwCFr79u2Tx+ORw+HQokWLFBMTYzoSAHyJBYug1a9fPxUU\nFCguLk4JCQl65ZVXuAoPQMBgwSIkHD16VG63Wy1atNDSpUvVqlUr05EAhDkWLEJCUlKSDh06pL59\n+yopKUlLlizhKjwARrFgEXKOHTsmt9utunXrKjs7Wx07djQdCUAYYsEi5HTr1k379u3T6NGj1bt3\nb82bN08VFRWmYwEIMyxYhLT33ntP6enpKikpUU5Ojrp37246EoAwwYJFSOvYsaO2b9+u++67T4MH\nD9aMGTNUVlZmOhaAMMCCRdj4+OOPdf/99+svf/mLvF6vkpKSTEcCEMJYsAgbrVq10rp16/TII49o\n5MiReuyxx3ThwgXTsQCEKAoWYcWyLE2cOFGFhYU6fvy4XC6X9u3bZzoWgBDEETHC2sqVK/XQQw9p\n3LhxevrppxUVFWU6EoAQwYJFWBs7dqx8Pp/Onj2r+Ph4bdu2zXQkACGCBQv8n40bNyozM1PDhw/X\nnDlz1KBBA9ORAAQxFizwf0aOHCmfz6c6derI4XBo7dq1piMBCGIsWOAb7Nq1S2lpaUpJSdGCBQvU\ntGlT05EABBkWLPANBg8erKKiIrVo0UJOp1Ovv/46V+EBuCosWOB75OXlye12q2PHjlq8eLFatGhh\nOhKAIMCCBb5Hr169dPToUSUkJMjlcsnr9bJmAXwvFixwFQoLC+V2u9W4cWNlZWWpbdu2piMBCFAs\nWOAqJCQkKC8vTz/4wQ/Us2dPLVq0iIvdAXwjFixQRe+88448Ho8sy1JOTo7i4uJMRwIQQFiwQBV1\n7txZubm5uuOOO9S3b1/Nnj1b5eXlpmMBCBAsWMAPPvjgA6Wnp+vs2bPyer2Kj483HQmAYSxYwA/a\ntWunrVu3atKkSRo6dKh+/etfq7S01HQsAAZRsICfWJYlj8ej/Px85efnKykpSQcPHjQdC4AhHBED\nNqisrNTrr7+un/70p5o4caJ+85vfKCIiwnQsADWIBQvYwLIsTZgwQcXFxTp16pQSEhKUm5trOhaA\nGsSCBWrAmjVrNHnyZI0ePVqzZs1SdHS06UgAbMaCBWrA6NGj5fP5dPHiRTkcDm3atMl0JAA2Y8EC\nNWzr1q3KyMjQoEGDNG/ePDVq1Mh0JAA2YMECNWzYsGEqLi5WvXr15HA4tGrVKtORANiABQsYtHfv\nXnk8HiUkJGjhwoVq3ry56UgA/IQFCxjUv39/FRQUqH379oqPj9err77KVXhAiGDBAgHiyJEjcrvd\natWqlZYsWaLY2FjTkQBUAwsWCBA9evTQoUOH1KtXLyUmJiorK4s1CwQxFiwQgHw+n9xut6KiorRs\n2TJ16NDBdCQAV4kFCwQgh8Oh/fv3a9SoUerVq5eef/55VVRUmI4F4CqwYIEAd/z4caWlpam0tFRe\nr1ddu3Y1HQnAFWDBAgGuU6dO2rlzp370ox9p4MCBevrpp1VWVmY6FoDvwYIFgshHH32kzMxMnT59\nWl6vV4mJiaYjAfgWLFggiLRu3VobNmzQww8/rBEjRuiXv/ylLly4YDoWgG9AwQJBxrIs/fjHP1ZR\nUZHefvttJSYm6s033zQdC8C/4YgYCHIrVqzQlClTdMcdd+jpp59WZGSk6UgAxIIFgt7tt9+u4uJi\nffrpp4qPj9eOHTtMRwIgFiwQUjZs2KD7779fN910k5577jnVr1/fdCQgbLFggRAyatQo+Xw+1apV\nSw6HQ+vWrTMdCQhbLFggRO3cuVPp6enq3bu35s+fryZNmpiOBIQVFiwQom688UYVFhaqWbNmcjqd\nWr58OZcHADWIBQuEgQMHDsjtdqtz58566aWXdMMNN5iOBIQ8FiwQBnr37q38/Hx1795dCQkJ+t3v\nfseaBWzGggXCTEFBgdxut5o1a6alS5eqTZs2piMBIYkFC4QZl8ulvLw8DRo0SD169NCLL76oS5cu\nmY4FhBwWLBDG3nrrLXk8HtWuXVvZ2dmKi4szHQkIGSxYIIx17dpVe/bs0dixY9W3b18999xzKi8v\nNx0LCAksWACSpBMnTig9PV3/+te/5PV65XQ6TUcCghoLFoAkqX379tq2bZsyMzM1ZMgQTZ8+XaWl\npaZjAUGLggXwJcuylJaWpvz8fB05ckTJyck6fPiw6VhAUKJgAfyH2NhYrVmzRo8++qhuueUWTZs2\nTSUlJaZjAUGFggXwjSzL0l133aWioiJ9+OGHcrlc2rNnj+lYQNDgQ04Arsgbb7yhBx54QGPGjNHM\nmTMVHR1tOhIQ0FiwAK7IrbfeKp/Pp/Pnz8vpdGrLli2mIwEBjQUL4Kpt2bJFGRkZGjJkiObOnauG\nDRuajgQEHBYsgKs2fPhwFRcXKyIiQg6HQ2+88YbpSEDAYcECqJbc3FylpaUpMTFRCxcuVLNmzUxH\nAgICCxZAtQwcOFCFhYVq06aNnE6nXnvtNa7CA8SCBeBHhw4dktvtVtu2bbVkyRK1bNnSdCTAGBYs\nAL/p2bPnl98A5XK5tGzZMtYswhYLFoAtiouL5Xa7Va9ePS1btkzt27c3HQmoUSxYALZwOp168803\nddNNNyklJUULFixQRUWF6VhAjWHBArDdu+++q7S0NJWXlysnJ0ddu3Y1HQmwHQsWgO3i4uK0a9cu\n3XPPPRowYIBmzpypsrIy07EAW7FgAdSoDz/8UBkZGTpz5oy8Xq9cLpfpSIAtWLAAalSbNm20adMm\nTZkyRcOHD9fjjz+uixcvmo4F+B0FC6DGWZale++9V4WFhTp27JiSkpJ04MAB07EAv+KIGIBRlZWV\nWrFihaZMmaIJEyZoxowZioiIMB0LqDYWLACjLMvSuHHjVFxcrL/97W9yOp3auXOn6VhAtbFgAQSU\ndevWadKkSbr55ps1e/Zs1atXz3QkoEpYsAACyi233CKfz6dLly7J4XBow4YNpiMBVcKCBRCwduzY\nobS0NPXr10/z589X48aNTUcCrhgLFkDAGjJkiIqLi9W4cWM5HA6tWLHCdCTgirFgAQSF/fv3y+Px\nqFu3bnrxxRcVExNjOhLwnViwAIJC3759lZ+fry5duig+Pl4vv/wyV+EhoLFgAQSd/Px8ud1uxcTE\naOnSpWrdurXpSMB/YMECCDqJiYk6ePCg+vfvrx49emjx4sW6dOmS6VjA17BgAQS1Y8eOyePx6Lrr\nrlN2drY6duxoOhIgiQULIMh169ZNe/fu1a233qo+ffpo7ty5XOyOgMCCBRAy3n//faWnp+uLL76Q\n1+tV9+7dTUdCGGPBAggZHTp00Pbt2+XxeDR48GA9+eSTKi0tNR0LYYoFCyAknTp1SpmZmTp16pS8\nXq969OhhOhLCDAsWQEiKjY3VunXrNHXqVI0aNUqPPvqoSkpKTMdCGKFgAYQsy7J0zz33qKioSCdO\nnJDL5dLevXtNx0KY4IgYQNj405/+pAcffFBjx47VzJkzFRUVZToSQhgLFkDYuO222+Tz+fT555/L\n6XRq69atpiMhhLFgAYSlTZs2KTMzU0OHDtXcuXPVoEED05EQYliwAMLSTTfdJJ/Pp7p168rhcGj1\n6tWmIyHEsGABhL3du3crLS1NycnJeuGFF9S0aVPTkRACWLAAwt6gQYNUWFio2NhYOZ1Ovf7661yF\nh2pjwQLAVxw8eFBut1sdOnTQ4sWL1aJFC9OREKRYsADwFSkpKTpy5IhcLpdcLpdycnJYs6gSFiwA\nfIuioiK53W41bNhQWVlZateunelICCIsWAD4FvHx8Tpw4ICGDRumlJQULVy4kIvdccVYsABwBd55\n5x15PB5JUk5Ojjp37mw4EQIdCxYArkDnzp2Vm5ur8ePHq1+/fnr22WdVXl5uOhYCGAsWAK7SyZMn\nlZ6ern/84x/yer1KSEgwHQkBiAULAFepbdu22rJlix544AENGzZMTzzxhC5evGg6FgIMBQsAVWBZ\nltxutwoKClRUVKSkpCTl5eWZjoUAwhExAFRTZWWlli9frp/85Ce6++679dRTTykiIsJ0LBjGggWA\narIsS3feeaeKi4v117/+VfHx8dq9e7fpWDCMBQsAfrZ27VpNmjRJqampmjVrlurVq2c6EgxgwQKA\nn6Wmpsrn86m8vFwOh0MbN240HQkGsGABwEbbtm1Tenq6Bg4cqOeff16NGjUyHQk1hAULADYaOnSo\niouL1aBBAzkcDq1cudJ0JNQQFiwA1JB9+/bJ4/HI6XRq0aJFat68uelIsBELFgBqSL9+/VRQUKBO\nnTopPj5ev//977kKL4SxYAHAgKNHj+q+++5Ty5YttXTpUrVq1cp0JPgZCxYADEhKStKhQ4fUp08f\nJSUlaenSpVyFF2JYsABg2J///Ge53W5FREQoOztbHTp0MB0JfsCCBQDDunfvrv379ys1NVW9evXS\nvHnzVFFRYToWqokFCwAB5L333lNaWpouXLignJwcde/e3XQkVBELFgACSMeOHbVjxw7de++9Gjx4\nsGbMmKGysjLTsVAFLFgACFAff/yxMjMz9cknn8jr9SopKcl0JFwFFiwABKhWrVpp/fr1euSRRzRy\n5Eg99thjunDhgulYuEIULAAEMMuyNHHiRBUWFur48eNyuVzav3+/6Vi4AhwRA0AQWblypR566CGN\nGzdOzzzzjCIjI01HwrdgwQJAEBk7dqx8Pp/Onj0rp9Op7du3m46Eb8GCBYAgtXHjRmVmZmrEiBGa\nM2eO6tevbzoSvoIFCwBBauTIkfL5fKpdu7YcDofWrl1rOhK+ggULACFg165dSktLU69evbRgwQI1\nadLEdKSwx4IFgBAwePBgFRUVKSYmRk6nU3/84x+5Cs8wFiwAhJi8vDy53W516tRJL730klq0aGE6\nUlhiwQJAiOnVq5eOHj0qp9Mpl8slr9fLmjWABQsAIaywsFBut1uNGzdWVlaW2rZtazpS2GDBAkAI\nS0hIUF5enoYMGaLk5GQtWrSIi91rCAsWAMLE22+/LY/Ho1q1aiknJ0dxcXGmI4U0FiwAhIkuXboo\nNzdX48aNU9++fTV79myVl5ebjhWyWLAAEIY++OADpaen6+zZs/J6vYqPjzcdKeSwYAEgDLVr105b\nt27VpEmTNHToUE2fPl2lpaWmY4UUChYAwpRlWfJ4PMrPz9fRo0fVo0cPHTp0yHSskEHBAkCYa9my\npVavXq1f/OIXSk1N1dSpU1VSUmI6VtCjYAEAsixLEyZMUHFxsU6dOqX4+Hjl5uaajhXU+JATAOA/\nrFmzRpMnT9YPf/hDPfvss4qOjjYdKeiwYAEA/2H06NHy+Xy6cOGCHA6HNm/ebDpS0GHBAgC+05Yt\nW5SRkaHBgwdr3rx5atSokelIQYEFCwD4TsOHD5fP51N0dLScTqdWrVplOlJQYMECAK7Y3r175fF4\nlJCQoIULF6p58+amIwUsFiwA4Ir1799fBQUFat++veLj4/Xqq69yFd63YMECAKrk8OHDcrvdat26\ntZYsWaLY2FjTkQIKCxYAUCXJyck6fPiwUlJSlJiYqKysLNbsV7BgAQDV5vP55Ha7FRUVpWXLlqlD\nhw6mIxnHggUAVJvD4dD+/fs1atQo9erVS/Pnz1dFRYXpWEaxYAEAfnX8+HGlpaWprKxMOTk56tq1\nq+lIRrBgAQB+1alTJ+3cuVMTJ07UwIED9cwzz6isrMx0rBrHggUA2Oajjz5SZmamTp8+La/Xq8TE\nxO/8+f859z/KOpKlXSd36bMLn+n62terXcN2yuyRqf6t+8uyrBpKXn0ULADAVpWVlXrllVc0depU\npaen61e/+pXq1q37tZ8pOF2gJ3Y+oS3vb5FlWbpQfuHL/7NkKfLaSDW+vrGm9ZumzORM1bIC/wCW\nggUA1IjTp09r8uTJeuutt+T1etWnTx9J0spjK/WjN36kkrISVeq7KymiToQGtRmklXes1PV1rq+J\n2FVGwQIAakxlZaVWrFihKVOmaPz48RrgHqCJaybqfPn5K35G3dp1NbDNQG24a4OuqXWNjWmrJ/A3\nNgAgZFiWpXHjxsnn8+nUZ6d0+x9vv6pylaQL5Re096O9mr1/tk0p/YOCBQDUuMaNGyvBnaA619ap\n0uvPl53X3P1zVXEpcH/XloIFANS4iksVWpC3QKWVpVV+RmlFqdYfX+/HVP5FwQIAatzOkzt1sfxi\ntZ7xeennWpC3wE+J/I+CBQDUuJNnT6qisvrHuyc+O+GHNPagYAEANe6L0i/88v5pSVmJH9LYg4IF\nANS4etfVU+1atav9nKhro/yQxh4ULACgxjmaOar9DEuWEmO++6sXTaJgAQA1LrlFsm6IvqFaz4io\nE6Gf9fmZnxL5HwULAKhxlmVpWr9piqwTWeVnxETFqHdsbz+m8i8KFgBgxATHBEXWiZSlq78hJ6JO\nhGYMmRHQt+tQsAAAIyKvjdSOH++46g8qRdaJ1OSekzXeMd6mZP5BwQIAjOnerLv2ufepyfVNdH3t\n774dp5ZVSxF1IvRfff9Ls4cG9vcQS9ymAwAIAP8o+Yeyj2Zr3pvz9EXZF/qi9Isvr66LqB2hisoK\npXZO1dS+U5XSMsVw2itDwQIAAsalykva8v4WHfnkiM6cP6Ooa6MUWy9W47qNU+OIxqbjXRUKFgAA\nG/AeLAAANqBgAQCwAQULAIANKFgAAGxAwQIAYAMKFgAAG1CwAADYgIIFAMAGFCwAADagYAEAsAEF\nCwCADShYAABsQMECAGADChYAABtQsAAA2ICCBQDABhQsAAA2oGABALABBQsAgA0oWAAAbEDBAgBg\nAwoWAAAbULAAANiAggUAwAYULAAANqBgAQCwAQULAIANKFgAAGxAwQIAYAMKFgAAG1CwAADYgIIF\nAMAGFCwAADagYAEAsAEFCwCADShYAABsQMECAGADChYAABtQsAAA2ICCBQDABhQsAAA2+F852Zfs\nREA1+wAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x118bb49d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "def employee_peers(award_num):\n",
    "    \n",
    "    \"\"\"\n",
    "    Creates a networkx plot of employees and students that have worked on an award.\n",
    "    \n",
    "    Parameters\n",
    "    ----------\n",
    "    award_num - The award_num of a specifc award, ie aw1006\n",
    "    \n",
    "    Returns \n",
    "    --------\n",
    "    A Networkx graph object of an award and the persons who worked on that award \n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    # declare variables\n",
    "    award = None\n",
    "    query_string = \"\"\n",
    "    query_result = None\n",
    "    worked_on_data_df = None\n",
    "    worked_on_columns = None\n",
    "    employees = None\n",
    "    awards = None\n",
    "    node = None\n",
    "    \n",
    "    # Collect Employees that worked on the requested award. \n",
    " \n",
    "    award = award_num\n",
    "    # This Cypher Query translates to,\n",
    "    # Fins the nodes that have a WORKED_ON relationship with an node of type Award that has the award_num of the value of the \n",
    "    # award variable. Return the employeeid and award number of the found nodes \n",
    "    \n",
    "    # build query string to get all nodes that worked on a particular award\n",
    "    query_string = \"MATCH ( person_node )\"\n",
    "    query_string += \" - [ relation : WORKED_ON ] ->\"\n",
    "    query_string += \" ( award : Award { award_num: '\"\n",
    "    query_string += award\n",
    "    query_string += \"'})\"\n",
    "    query_string += \" RETURN person_node.employeeid, person_node.position, award.award_num\"\n",
    "    #query_string += \" LIMIT 5\"\n",
    "    query_string += \";\"\n",
    "    \n",
    "    # run query\n",
    "    query_result = graph_db.data( query_string ) \n",
    "    \n",
    "    # Convert to DataFrame\n",
    "    worked_on_data_df = pandas.DataFrame( query_result )\n",
    "    \n",
    "    # get columns\n",
    "    worked_on_columns = worked_on_data_df.columns\n",
    "\n",
    "    # break this out - replace periods with underscores in column names\n",
    "    worked_on_columns = worked_on_columns.map(lambda x: x.replace('.', '_') if isinstance( x, six.string_types ) else x)\n",
    "\n",
    "    # place updated columns back in the DataFrame.\n",
    "    worked_on_data_df.columns = worked_on_columns\n",
    "    \n",
    "    pprint.pprint( worked_on_data_df )\n",
    "\n",
    "    # Create the Networkx Graph \n",
    "    worked_on_graph = networkx.from_pandas_dataframe( worked_on_data_df, 'person_node_employeeid', 'award_award_num' )\n",
    "    \n",
    "    # pprint.pprint( worked_on_graph )\n",
    "\n",
    "    # get colors for nodes\n",
    "    worked_on_nodes = worked_on_graph.nodes( data = True )\n",
    "\n",
    "    # The following code is used to keep track of employees vs. award numbers,\n",
    "    # and then to assign colors to nodes of each type in the graph\n",
    "    employees = dict.fromkeys( worked_on_data_df.person_node_employeeid.unique(), 1 )\n",
    "    awards = dict.fromkeys( worked_on_data_df.award_award_num.unique(), 1 )\n",
    "    \n",
    "    # loop over nodes, setting a color value for each.\n",
    "    color_values = []\n",
    "    for node in worked_on_graph.nodes( data = True ):\n",
    "        \n",
    "        # get Node ID\n",
    "        node_id = node[ 0 ]\n",
    "        \n",
    "        # person or award?\n",
    "        if node_id in employees:\n",
    "\n",
    "            color_values.append ('g')  # green\n",
    "\n",
    "        else:\n",
    "        \n",
    "            color_values.append ('r')  # red\n",
    "            \n",
    "        #-- END check to see what type of node --#\n",
    "        \n",
    "    #-- END loop over nodes. --#\n",
    "            \n",
    "    # draw the graph.\n",
    "    networkx.draw( worked_on_graph, node_color = color_values )\n",
    "    \n",
    "    # Return the Graph Object\n",
    "    graph_OUT = worked_on_graph\n",
    "\n",
    "    return graph_OUT\n",
    "\n",
    "#-- END function employee_peers() --#\n",
    "        \n",
    "# Testing the function with the award aw1501\n",
    "employee_peers(\"aw1501\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Part 3 - Analyzing Networks\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "The networkx module also has built in tools to analyse graphs. The following measurements are used to assess how the nodes are related to each other in the graph database."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "### Network Measures \n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "The following are some examples of traits of individual nodes and the overall network in a network graph that can be used to characterize network data:\n",
    "\n",
    "- **Degree Centrality ** - counts the number of edges that an individual node has \n",
    "\n",
    "    - Nodes with a high degree of connections usually play an important role in a network\n",
    "    - This can also be looked at in aggregate for all nodes in a graph to get an idea of the overall connectedness of the graph.  For example, calculate the mean and median degree centrality across all nodes to look at how connected a graph is, in general.\n",
    "\n",
    "- **Betweenness ** - indicator of a node's centality in a network. \n",
    "\n",
    "    - Equal to the number of shortest paths from all vertices to all others that pass through that node\n",
    "    - This also can be looked at in aggregate to characterize an entire network.\n",
    "\n",
    "- **Diameter** - The longest shortest path over all pairs of nodes \n",
    "\n",
    "    - Often we want to find the shortest distance between two nodes; the diameter is the longest of these paths \n",
    "     - Nodes that occur on many shortest paths between other nodes in the graph have a high betweenness centrality score\n",
    "\n",
    "- **Cliques ** - A clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent.\n",
    "\n",
    "The functions below are written for your conviencence by http://www.slideshare.net/arnicas/a-quick-and-dirty-intro-to-networkx-and-d3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false,
    "nbgrader": {
     "grade": true,
     "grade_id": "correct_sum_of_squares",
     "locked": true,
     "points": 1,
     "solution": false
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "def calculate_degree_centrality() --COMPLETE-- at 2017-05-08 11:29:42.855105\n"
     ]
    }
   ],
   "source": [
    "def calculate_degree_centrality(graph):\n",
    "    ''' \n",
    "    Calculate degree centrality of a node, sets value on node as attribute; returns graph, and dict of the degree centrality values.\n",
    "\tAlso has code to print the top 10 nodes by degree centrality to console\n",
    "    \n",
    "    Parameters\n",
    "    ----------\n",
    "    graph - A Networkx object Graph \n",
    "\t'''\n",
    "    g = graph\n",
    "    dc = networkx.degree_centrality(g)\n",
    "    networkx.set_node_attributes(g, 'degree_centrality', dc)\n",
    "    degcent_sorted = sorted(dc.items(), key = operator.itemgetter(1), reverse = True)\n",
    "    for key, value in degcent_sorted[0:10]:\n",
    "        print( \"Highest degree Centrality:\" + str( key ) + \" - \" + str( value ) )\n",
    "    return graph, dc \n",
    "\n",
    "print( \"def calculate_degree_centrality() --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "def calculate_betweenness() --COMPLETE-- at 2017-05-08 11:29:45.954098\n"
     ]
    }
   ],
   "source": [
    "def calculate_betweenness(graph):\n",
    "    ''' \n",
    "    Calculate betweenness centrality of a node, sets value on node as attribute; returns graph, and dict of the betweenness centrality values\n",
    "\n",
    "    Parameters\n",
    "    ----------\n",
    "    graph - A Networkx object Graph \n",
    "    '''\n",
    "    g = graph\n",
    "    bc=networkx.betweenness_centrality(g)\n",
    "    networkx.set_node_attributes(g,'betweenness',bc)\n",
    "    degcent_sorted = sorted(bc.items(), key = operator.itemgetter(1), reverse = True)\n",
    "    for key, value in degcent_sorted[0:10]:\n",
    "        print( \"Highest Betweeness:\" + str( key ) + \" - \" + str( value ) )\n",
    "    return g #, bc\n",
    "\n",
    "print( \"def calculate_betweenness() --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "def find_cliques() --COMPLETE-- at 2017-05-08 11:29:47.085227\n"
     ]
    }
   ],
   "source": [
    "def find_cliques(graph):\n",
    "\t''' \n",
    "    Calculate cliques and return as sorted list.  Print sizes of cliques found.\n",
    "    \n",
    "    Parameters\n",
    "    ----------\n",
    "    graph - A Networkx object Graph \n",
    "\t'''\n",
    "\tg = graph\n",
    "\tcl = networkx.find_cliques(g)\n",
    "\tcl = sorted(list( cl ), key=len, reverse=True)\n",
    "\tprint( \"Number of cliques: \" + str( len(cl) ) )\n",
    "\tcl_sizes = [len(c) for c in cl]\n",
    "\tprint( \"Size of cliques:\" + str( cl_sizes ) )\n",
    "\treturn cl\n",
    "\n",
    "print( \"def find_cliques() --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "def find_diameter() --COMPLETE-- at 2017-05-08 11:29:48.136094\n"
     ]
    }
   ],
   "source": [
    "def find_diameter(graph):\n",
    "    \"\"\"\n",
    "    Calculate the Diameter of a graph\n",
    "    \n",
    "    Parameters\n",
    "    ----------\n",
    "    graph - A Networkx object Graph    \n",
    "    \"\"\"\n",
    "    diameter = networkx.diameter(graph)\n",
    "    print( \"Diameter: \" + str( diameter ) )\n",
    "    return diameter\n",
    "\n",
    "print( \"def find_diameter() --COMPLETE-- at \" + str( datetime.datetime.now() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Exercise - Calculating Network Metrics\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Perform some exploritory analysis on the full data. Use the funtions above to:\n",
    "\n",
    "1. Obtain a list of the highest 10 levels of Degree Centrality\n",
    "2. Obtain a list of the highest 10 levels of Betweenness\n",
    "3. The number of cliques and the sizes of those cliques. \n",
    "\n",
    "By looking at these results, what do you think about the shape of the graph? How would you charaterize the relationships in the graph? "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "collapsed": false,
    "nbgrader": {
     "grade": true,
     "grade_id": "sum_of_squares_uses_squares",
     "locked": true,
     "points": 1,
     "solution": false
    },
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "_________________DEGREE CENTRALITY ________________\n",
      "Highest degree Centrality:(a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}) - 1.0\n",
      "Highest degree Centrality:(a43fe2c:Award {award_num:\"aw1468\"}) - 0.5\n",
      "Highest degree Centrality:(f6b7edd:Award {award_num:\"aw1257\"}) - 0.5\n",
      "_________________Betweenness ________________\n",
      "Highest Betweeness:(a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}) - 1.0\n",
      "Highest Betweeness:(a43fe2c:Award {award_num:\"aw1468\"}) - 0.0\n",
      "Highest Betweeness:(f6b7edd:Award {award_num:\"aw1257\"}) - 0.0\n",
      "_________________Cliques ________________\n",
      "Number of cliques: 2\n",
      "Size of cliques:[2, 2]\n",
      "__________________________________________\n"
     ]
    }
   ],
   "source": [
    "print( \"_________________DEGREE CENTRALITY ________________\" )\n",
    "calculate_degree_centrality( all_relations_nx )\n",
    "print( \"_________________Betweenness ________________\" )\n",
    "calculate_betweenness( all_relations_nx )\n",
    "print( \"_________________Cliques ________________\" )\n",
    "find_cliques( all_relations_nx )\n",
    "print( \"__________________________________________\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Exercise - Analyzing a Sub Graph \n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "From looking at the measures above, it seems like our graph has a lot of independent units that are not connected to the larger graph. For instances, there are a lot of cliques with length 2. This indicates one employee working on one award. Let's say we are interested in the sub-network where all the nodes are connected. \n",
    "\n",
    "Preform the same exploritory analysis on the subset created below. The subset is the largest connected set of nodes in the graph. \n",
    "\n",
    "Use the funtions above to:\n",
    "\n",
    "1. Obtain a list of the highest 10 levels of Degree Centrality\n",
    "2. Obtain a list of the highest 10 levels of Betweenness\n",
    "3. The number of cliques and the sizes of those cliques\n",
    "4. Find the Diameter of the Subgraph\n",
    "    \n",
    "By looking at these results, what do you think about the shape of the graph? how would you charaterized the relationships in the graph? "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of Awards: 2\n",
      "Number of Students: 0\n",
      "Number of Faculty: 1\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAdgAAAFCCAYAAABSJMy8AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHpJJREFUeJzt3X9QlIe97/EPsCAIOh4J0XC1TviVUBwZsWpDEghBI9cO\njoyXHIz1JDW5Jsc6jrWpJxnjLruOx4kmXut4HMfjxHZMRs8QLwlpEq2iIVZtSEuVQyphVxyjDfWQ\nUGoQiMA+9w+OexODP5B9ePbH+/VPOkaWDzOdeWcX+G6EYRiGAACAX0VaPQAAgFBEYAEAMAGBBQDA\nBAQWAAATEFgAAExAYAEAMAGBBQDABAQWAAATEFgAAExAYAEAMAGBBQDABAQWAAATEFgAAExAYAEA\nMAGBBQDABAQWAAATEFgAAExAYAEAMAGBBQDABAQWAAATEFgAAExAYAEAMAGBBQDABAQWAAAT2Kwe\ngCDz179KdXVSe7s0YoSUnCzNnClF8t9qAPBNBBa3ZhjSsWPSpk3SoUNSbKzk9UoREf3/Lj5e+tnP\npKeflhITrV4LAAEhwjAMw+oRCGDt7dKPfiTV10tXrvQHdSBxcf3/3L1b+sd/HL59ABCgeAaLG2tv\nl37wA+nCBenq1Zv/3a6u/n/+5Cf9H/fss+bvA4AAxjNYDMzrlXJzpT/96dZxvV5cnFRVJc2aZc42\nAAgC/GQKBnbkiPTJJ4OPq9T/bHbVKv9vAoAgQmAxsI0bpY6OO//4s2elU6f8twcAggyBxXddvCh9\n+OHQHuPrr6XNm/2zBwCCEIHFd330Uf/vuA5FX5909Kh/9gBAECKw+K729v5ADtVQXmIGgCBHYPFd\nMTH9RySGysZvgQEIXwQW3zV+vH8Ce/fdQ38MAAhSBBbflZ8/5NvCxsiRHJsAENYILL4rJkb6538e\n0g86fd3VpbfHjJHX6/XjMAAIHlxywsAuXpTS06Xu7kF/qBETo7889JDm//3v6u3tldPp1Lx58xTh\nj5edASBI8AwWA5swQXr1VWnkyMF9XGSkIsaP14Q339THH38sl8slh8Oh6dOn69133xX/PQcgXPAM\nFje3fr30r/8qdXbe+u/GxEjjxvW/td2kSb4/9nq9euutt+RwOBQfHy+Xy6XZs2fzjBZASCOwuLX9\n+6Wf/1z64ov+0F7/f5m4uP4/mz9f+rd/k8aOHfBhvF6vKioqVF5ersTERLlcLhUUFBBaACGJwOL2\nGIb0u9/1v+n673/f/96wNpuUlNT/08JLltz2m6339fVp3759cjqdSk5OlsvlUl5enslfAAAMLwIL\ny/T29uqNN96Qy+XSvffeK5fLpdzcXKtnAYBf8ENOsIzNZtOTTz6pxsZGLVy4UE888YSKiopUW1tr\n9TQAGDICC8tFR0fr6aefVlNTk0pKSrRgwQIVFxerrq7O6mkAcMcILAJGTEyMnn32Wbndbs2ZM0fF\nxcUqKSnR6dOnrZ4GAINGYBFwYmNjtXz5cnk8HuXn56uoqEilpaVqaGiwehoA3DYCi4AVFxenlStX\nyuPxaObMmSosLNTChQvV2Nho9TQAuCUCi4AXHx+v559/XmfPnlV2drby8vK0ePFiud1uq6cBwA0R\nWASNhIQEvfDCC/J4PLrvvvuUm5urJUuWqLm52eppAPAdBBZBZ/To0XrppZfkdrs1ceJEzZgxQ0uX\nLtX58+etngYAPgQWQWvMmDFyOp1qampSUlKScnJytGzZMl28eNHqaQBAYBH8xo4dq/Xr16uxsVGj\nRo3SlClTtGLFCrW0tFg9DUAYI7AIGUlJSXr55Zd15swZRUdHKysrS6tWrdKlS5esngYgDBFYhJxx\n48bp1Vdf1SeffKK+vj5lZmZq9erV+uKLL6yeBiCMEFiErHvuuUe//OUvVV9fr46ODt13331as2aN\n2trarJ4GIAwQWIS8CRMmaPv27aqrq1Nra6syMjLkcDjU3t5u9TQAIYzAImxMmjRJO3fuVG1trS5c\nuKD09HStW7dOly9ftnoagBBEYBF2UlJS9Nprr+nEiRNqampSWlqaNmzYoI6ODqunAQghBBZhKz09\nXXv27FFNTY3q6+uVmpqqV155RZ2dnVZPAxACCCzCXmZmpvbu3avq6mp99NFHSk1N1ZYtW9TV1WX1\nNABBjMAC/23y5MmqqKjQgQMHVFNTo7S0NG3btk3d3d1WTwMQhAgscJ3s7GxVVlaqqqpKBw8eVHp6\nunbs2KGrV69aPQ1AECGwwA1MmzZN77zzjvbv36+3335bGRkZ2rVrl3p6eqyeBiAIRBiGYVg9AggG\nJ06ckMPhUHNzs+x2uxYtWiSbzWb1LAABisACg/Thhx/Kbrfr888/l8PhUFlZmaKioqyeBSDAEFjg\nDhiGoaNHj2rt2rVqa2tTeXm5SktLFRnJd10A9COwwBAYhqFDhw7JbrfrypUrKi8vV0lJCaEFQGAB\nfzAMQ++//77sdrt6e3vldDo1b948RUREWD0NgEUILOBHhmGoqqpKDodDNptNTqdTc+fOJbRAGCKw\ngAm8Xq8qKyvlcDiUkJAgl8ul2bNnE1ogjBBYwERer1cVFRUqLy9XYmKiXC6XCgoKCC0QBggsMAz6\n+vq0b98+OZ1OJScny+VyKS8vz+pZAExEYIFh1NvbqzfeeEMul0v33nuvXC6XcnNzrZ4FwAT8LgEw\njGw2m5588kk1NjaqrKxMTzzxhIqKilRbW2v1NAB+RmABC0RHR+uZZ55RU1OT5s+frwULFqi4uFh1\ndXVWTwPgJwQWsFBMTIyee+45ud1uzZkzR8XFxSopKdHp06etngZgiAgsEABiY2O1fPlyeTwe5efn\nq6ioSKWlpWpoaLB6GoA7RGCBABIXF6eVK1fK4/Fo5syZKiws1MKFC9XY2Gj1NACDRGCBABQfH6/n\nn39eZ8+eVXZ2tvLy8rR48WK53W6rpwG4TQQWCGAJCQl64YUX5PF4dN999yk3N1dLlixRc3Oz1dMA\n3AKBBYLA6NGj9dJLL8ntdmvixImaPn26li5dqvPnz1s9DcANEFggiIwZM0ZOp1Nut1tJSUnKycnR\nsmXLdPHiRaunAbgOgQWC0NixY7V+/Xo1NjZq1KhRmjJlilasWKGWlharpwH4bwQWCGJJSUl6+eWX\ndebMGdlsNmVlZWnVqlW6dOmS1dOAsEdggRAwbtw4bd68WQ0NDert7VVmZqZWr16t1tZWq6cBYYvA\nAiEkOTlZW7duVX19vTo6OnT//fdrzZo1amtrs3oaEHYILBCCJkyYoO3bt6uurk6tra3KyMiQw+FQ\ne3u71dOAsEFggRA2adIk7dy5U7W1tbpw4YLS0tK0bt06Xb582eppQMgjsEAYSElJ0WuvvaaTJ0+q\nqalJaWlp2rBhgzo6OqyeBoQsAguEkfT0dO3Zs0c1NTWqr69XamqqNm3apM7OTqunASGHwAJhKDMz\nU3v37lV1dbVqa2uVmpqqLVu2qKury+ppQMggsEAYmzx5sioqKnTgwAHV1NQoLS1N27ZtU3d3t9XT\ngKBHYAEoOztblZWVqqqq0sGDB5Wenq4dO3bo6tWrVk8DghaBBeAzbdo0vfPOO9q/f7/efvttZWRk\naNeuXerp6bF6GhB0IgzDMKweASAwHT9+XA6HQ+fOnZPdbteiRYtks9msngUEBQIL4JZqampkt9vV\n0tIih8OhsrIyRUVFWT0LCGgEFsBtMQxDR48e1dq1a9XW1qby8nKVlpYqMpLvNAEDIbAABsUwDB06\ndEh2u11XrlxReXm5SkpKCC1wHQIL4I4YhqH3339fdrtdvb29cjqdmjdvniIiIqyeBgQEAgtgSAzD\nUFVVlRwOh2w2m5xOp+bOnUtoEfYILAC/8Hq9qqyslMPhUEJCglwul2bPnk1oEbYILAC/8nq9qqio\nUHl5uRITE+VyuVRQUEBoEXYILABT9PX1ad++fXI6nUpOTpbL5VJeXp7Vs4BhQ2ABmKq3t1evv/66\nXC6XUlJS5HK5lJuba/UswHT8XD0AU9lsNj311FP69NNPVVZWpieeeEJFRUWqra21ehpgKgILYFhE\nR0frmWeeUVNTk+bPn68FCxaouLhYdXV1Vk8DTEFgAQyrmJgYPffcc3K73ZozZ46Ki4tVUlKi06dP\nWz0N8CsCC8ASsbGxWr58uTwej/Lz81VUVKTS0lI1NDRYPQ3wCwILwFJxcXFauXKlPB6PZs6cqcLC\nQi1cuFCNjY1WTwOGhMACCAjx8fF6/vnndfbsWU2ZMkUPP/ywFi9eLLfbbfU04I4QWAABJSEhQS++\n+KLOnj2rjIwMPfDAA1qyZImam5utngYMCoEFEJBGjx6ttWvXyuPxaOLEiZo+fbqWLl2q8+fPWz0N\nuC0EFkBAGzNmjJxOp9xut5KSkpSTk6Nly5bp4sWLVk8DborAAggKY8eO1fr169XY2KiEhARNmTJF\nK1asUEtLi9XTgAERWABBJSkpSRs3btSZM2dks9mUlZWlVatW6dKlS1ZPA76FwAIISuPGjdPmzZvV\n0NCg3t5eZWZmavXq1WptbbV6GiCJwAIIcsnJydq6davq6+vV0dGh+++/X2vWrFFbW5vV0xDmCCyA\nkDBhwgRt375ddXV1am1tVUZGhhwOh9rb262ehjBFYAGElEmTJmnnzp2qra3VZ599prS0NK1bt06X\nL1+2ehrCDIEFEJJSUlK0e/dunTx5Uk1NTUpLS9OGDRvU0dFh9TSECQILIKSlp6drz549qqmpUX19\nvVJTU7Vp0yZ1dnZaPQ0hjsACCAuZmZnau3evqqurVVtbq9TUVG3ZskVdXV1WT0OIIrAAwsrkyZNV\nUVGhAwcOqKamRmlpadq2bZu6u7utnoYQQ2ABhKXs7GxVVlaqqqpKBw8eVHp6unbs2KGrV69aPQ0h\ngsACCGvTpk3TO++8ozfffFNvvfWWMjIytGvXLvX09Fg9DUEuwjAMw+oRABAojh8/LofDoXPnzslu\nt2vRokWy2WxWz0IQIrAAMICamhrZ7Xa1tLTI4XCorKxMUVFRVs9CECGwAHADhmHo6NGjWrt2rdra\n2lReXq7S0lJFRvLdNdwagQWAWzAMQ4cOHdLatWt15coVOZ1OlZSUEFrcFIEFgNtkGIbee+892e12\n9fX1yel0at68eYqIiLB6GgIQgQWAQTIMQ1VVVXI4HLLZbHI6nZo7dy6hxbcQWAC4Q16vV5WVlXI4\nHIqPj5fL5dJjjz1GaCGJwALAkHm9XlVUVKi8vFyJiYlyuVwqKCggtGGOwAKAn/T19Wnfvn1yOp1K\nTk6Wy+VSXl6e1bNgEQILAH7W29ur119/XS6XSykpKXK5XMrNzbV6FoYZP2MOAH5ms9n01FNP6dNP\nP1VZWZkWLlyooqIi1dbWWj0Nw4jAAoBJoqOj9cwzz8jtdmv+/PlasGCBiouLVVdXZ/U0DAMCCwAm\ni4mJ0XPPPSe32605c+aouLhYJSUlOn36tNXTYCICCwDDJDY2VsuXL5fH41F+fr6KiopUWlqqhoYG\nq6fBBAQWAIZZXFycVq5cKY/HoxkzZqiwsFALFy5UY2Oj1dPgRwQWACwSHx+vX/ziF/J4PJoyZYoe\nfvhhLV68WG632+pp8AMCCwAWGzVqlF588UWdPXtWGRkZeuCBB7RkyRI1NzdbPQ1DQGABIECMHj1a\na9eulcfj0cSJEzV9+nQtXbpU58+ft3oa7gCBBYAAM2bMGDmdTrndbiUlJSknJ0fLli3TxYsXrZ6G\nQSCwABCgxo4dq/Xr16uxsVEJCQmaMmWKVqxYoZaWFqun4TYQWAAIcElJSdq4caPOnDkjm82mrKws\nrVq1SpcuXbJ6Gm6CwAJAkBg3bpw2b96shoYG9fb2KjMzU6tXr1Zra6vV0zAAAgsAQSY5OVlbt27V\n6dOn1dHRofvvv19r1qxRW1ub1dPwDQQWAILUxIkTtX37dtXV1am1tVUZGRlyOBxqb2+3ehpEYAEg\n6E2aNEk7d+5UbW2tPvvsM6WlpWndunW6fPmy1dPCGoEFgBCRkpKi3bt36+TJk2pqalJqaqo2bNig\njo4Oq6eFJQILACEmPT1de/bs0Ycffqj6+nqlpqZq06ZN6uzstHpaWCGwABCiMjMztXfvXlVXV6u2\ntlapqanasmWLurq6rJ4WFggsAIS4yZMnq6KiQgcOHFBNTY3S0tK0bds2dXd3Wz0tpBFYAAgT2dnZ\nqqysVFVVlQ4cOKD09HTt2LFDV69etXpaSCKwABBmpk2bpt/85jd688039dZbbykjI0O7du1ST0+P\n1dNCSoRhGIbVIwAA1jl+/LgcDofOnTsnu92uRYsWyWazWT0r6BFYAIAkqaamRna7XS0tLXI4HCor\nK1NUVJTVs4IWgQUA+BiGoSNHjshut6utrU3l5eUqLS1VZCTfURwsAgsA+A7DMPTb3/5WdrtdV65c\nkdPpVElJCaEdBAILALghwzD03nvvyW63q6+vT06nU/PmzVNERITV0wIegQUA3JJhGKqqqpLdbld0\ndLScTqfmzp1LaG+CwAIAbpvX61VlZaUcDofi4+Plcrn02GOPEdoBEFgAwKB5vV5VVFSovLxciYmJ\ncrlcKigoILTfQGABAHesr69P+/btk9PpVHJyslwul/Ly8qyeFRAILABgyHp7e/X666/L5XIpJSVF\nLpdLubm5d/x4XsOrr77+SrG2WI2wjfDj0uFDYAEAftPT06Nf//rXWrdunTIzM+V0OjVz5szb+tjO\nnk7t/c+92nhio9xfuhUdGa1eo1dxtjj9U/Y/aeUPVyojMcPkr8B/CCwAwO+uXr2q1157TevXr1d2\ndracTqemTZs24N81DEPrPlynjcc3KkIR6uj57hvER0dGyxZp09R7puo//td/aMLoCWZ/CUNGYAEA\npunu7tauXbu0YcMGzZgxQ+Xl5crOzvb9e6/h1aL9i1TVVKXOnlu/IXxURJTGxI7RsZ8cU2ZSppnT\nh4yTHAAA08TGxmr58uXyeDzKy8vTnDlzVFpaqoaGBknSivdX3HZcJanP6FNbV5vyf5Wvlq9azJw+\nZDyDBQAMmytXrmj79u165ZVXNPV/TlVNWo26+wb/xu+2CJsez3pcbyx4w4SV/kFgAQDD7quvvlLe\n/8nTqb5Td/xaaqwtVi0/b9GY2DH+HecnvEQMABh2fdF9aoxqHFKFIiMitftPu/03ys8ILABg2B06\ne0jRkdFDeozOnk796vSv/DPIBAQWADDsWjtb1ePtGfLjfNn5pR/WmIPAAgCGndfwBtTjmIHAAgCG\nXXxUvCK8Q39jgED9ASdJslk9AAAQ+rxer06dOqXDhw/r8OHDOv6fx9X9v7ulqDt/zBFRIzT//vn+\nG+lnPIMFAJiiublZO3fu1OOPP667775bixYt0oULF/TTn/5Unzd+rjkZc4b8OZZNX+aHpebg92AB\nAH7xxRdf6MiRI75nqd3d3Zo1a5YKCwtVWFioCRO+fT/4yLkjmrd3nq70XLmjz/dY6mM6+OOD/phu\nCgILALgjnZ2dOnbsmC+ozc3Nys/P16xZszRr1ixlZmbe9A3YDcPQnNfn6Nhnx9TdO7hrTvHR8fro\nmY+UdXfWUL8M0xBYAMBt6e3t1R//+EdfUP/whz9o6tSpvqBOnz5d0dGD+93Wzp5OPfTaQ2r8olFd\nvV239TEjo0eqqqxKhSmFd/JlDBsCCwAYkGEYampq8gX1gw8+0Pe+9z3fy755eXlKSEgY8ufp6unS\nj//vj/We5z31eftu+Puxo2JGKdYWq3efeFfT/8f0IX9esxFYAIBPS0uLqqurVV1drcOHDysiIkKz\nZ8/WrFmz9Oijj2rcuHGmfW5Pm0e//P0vtfvUbkVGRCoyIlKGDH3d+7Vy7snRvzz4L/pRxo9kiwyO\nX4AhsAAQxr766ivV1NT4nqV+/vnnKigo8L3sm5aWdtPvo5qhq6dL59rPqb27XXG2ON0z6h6NTxg/\nrBv8gcACQBjp6enRRx995Avq6dOnNWPGDF9Qc3JyFBU1hF9OhQ+BBYAQZhiGGhoafC/5Hjt2TOnp\n6b7voz744IMaOXKk1TNDEoEFgBBz4cIF3zPU6upqJSQk+J6hFhQUKDEx0eqJYYHAAkCQ+9vf/qYP\nPvjAF9W2tjYVFhb6nqXee++9Vk8MSwQWAIJMd3e3Tpw44XvZ98yZM3rwwQd9QZ0yZYoiI7mEazUC\nCwAB7vpD+SdPntTkyZN9L/v+8Ic/1IgRI6yeiesQWAAIQM3Nzb6gHjlyRElJSb6g5ufna8yYwH2b\nNvQjsAAQAAZ7KB+Bj8ACgAWuHcq/9n3Us2fPDupQPgIfgQWAYXD9ofyPP/5YOTk5QzqUj8BGYAHA\nBAMdyp84caIvqP46lI/ARWABwE+sPJSPwENgAeAOBeKhfAQOAgsAt4lD+RgMAgsAN8ChfAwFgQWA\nb+BQPvyFwAIIaxzKh1kILICw0t3drZMnT/qC+uc//9l3KH/WrFkcyoffEFgAIe2bh/Krq6t14sQJ\nDuVjWBBYACGHQ/kIBAQWQNC7/lB+V1eXL6gcyodVCCyAoHOzQ/mFhYX6/ve/z4EHWI7AAgh4HMpH\nMCKwAAIOh/IRCggsgIAw0KH8a0F99NFHNX78eKsnAoNCYAFYgkP5CHUEFsCw4FA+wg2BBWCKgQ7l\np6Wl+YLKoXyEOgILwG84lA/8fwQWwB3jUD5wYwQWwG3jUD5w+wgsgBsa6FB+VlaWL6gPPPAAh/KB\nGyCwAL6FQ/mAfxBYIMxxKB8wB4EFwsxAh/Lz8vJ8UeVQPuAfBBYIcRzKB6xBYIEQw6F8IDAQWCAE\ncCgfCDwEFghCAx3Kf+SRR3xRTU9P5/uogMUILBAErj+Uf+rUKc2cOZND+UAAI7BAADIMQ5988okv\nqBzKB4IPgQUCxLVD+de+jxofH/+tQ/l33XWX1RMBDAKBBSzCoXwgtBFYYJhwKB8ILwQWMAmH8oHw\nRmABPxroUP61l30feeQRDuUDYYTAAkPAoXwAN0JggUHgUD6A20VggZsY6FD+1KlTfUGdMWMGh/IB\nDIjAAt9wq0P5Dz/8sEaNGmX1TABBgMAi7HEoH4AZCCzCzvWH8v/yl7+ooKCAQ/kA/IrAIuTd6FD+\ntV+fmTZtGofyAfgdgUXI4VA+gEBAYBESOJQPINAQWASlgQ7lP/roo74DDykpKVZPBBDmCCyCAofy\nAQQbAouAxKF8AMGOwCJgXH8o/6677vIFlUP5AIINgYVlbnQov7CwUIWFhZo4caLVEwHgjhFYDBsO\n5QMIJwQWpuFQPoBwRmDhNzc6lH/tYlJeXh6H8gGEDQKLIfnrX//qe8n38OHDkqTZs2dzKB9A2COw\nGJRvHsqvrq7WxYsXOZQPAAMgsLipgQ7lz5gxwxdUDuUDwMAILL7lZofyCwsL9dBDD3EoHwBuA4EF\nh/IBwAQENgxdfyj/yy+/9P2kL4fyAcA/CGwYuNGh/GtRzc7O5lA+APgZgQ1BHMoHAOsR2BDBoXwA\nCCwENkhdfyi/s7PTF1QO5QOA9QhskLjZofzCwkJlZWVx4AEAAgiBDVAcygeA4EZgJamlRaqvl/7+\ndyk2VpowQZo6VRrGZ4QDHcqfMGGCL6gcygeA4BK+gTUM6ehRadMm6YMPpBEjJK9XioyU+vqkxERp\n9Wpp8WLJpLDd6FD+tTcc51A+AASv8AzsF19Ic+ZITU1SR8eN/158fP+z2P37pcceG/Kn5VA+AISP\n8Avsf/2X9IMfSJcuSVev3t7HxMVJe/ZICxYM6lPd6lB+Tk6ObDbbHXwRAIBAF16B7emRcnKkTz/t\n/9+DERcn1dRI06ff8K9wKB8AcE14BXb/fumpp27+svDNFBRIR4586484lA8AGEh4BXbGDOnjj+/8\n42Nj9fff/15HvnE1iUP5AICBhE9gGxv7Xx7u6rrjh7gaEaEdNpve/cYPJnEoHwAwkPD5CZvf/W7I\nv9caYxhanpGhFQcP+mkUACBUhc9Tr/b2wf9g0wAiL1/2wxgAQKgLn8BGR/cfkfDH4wAAcAvhE9jx\n46WYGP88DgAAtxA+gZ07V+rtHdpjJCRIzz7rnz0AgJAWPoEdNUpauFCKihra4zz+uH/2AABCWvgE\nVpJWrbrzl4lHjJCefrr/3XYAALiF8ApsVlb/O+QM9lyhzSZNmiStW2fOLgBAyAmfQxPXGIb0s59J\n//7vUmfnrf/+iBH97w977Jh0zz3m7wMAhITwegYr9R+b2LJF2rpVGjeu/weXBjJyZP/LwaWlUl0d\ncQUADEr4PYP9Jq9X+u1vpY0bpVOnpCtX+r9He/fd0k9/Kv3kJ9I//IPVKwEAQSi8AwsAgEnC7yVi\nAACGAYEFAMAEBBYAABMQWAAATEBgAQAwAYEFAMAEBBYAABMQWAAATEBgAQAwAYEFAMAEBBYAABMQ\nWAAATEBgAQAwAYEFAMAEBBYAABMQWAAATEBgAQAwAYEFAMAEBBYAABMQWAAATEBgAQAwAYEFAMAE\nBBYAABMQWAAATEBgAQAwAYEFAMAEBBYAABMQWAAATEBgAQAwAYEFAMAEBBYAABMQWAAATEBgAQAw\nAYEFAMAEBBYAABMQWAAATEBgAQAwAYEFAMAEBBYAABP8P61CQKJrFjF8AAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x1135d5110>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Create the Subgraph \n",
    "subgraph_generator = max( networkx.connected_components( all_relations_nx ), key = len )\n",
    "\n",
    "subgraph_graph = all_relations_nx.subgraph( subgraph_generator )\n",
    "\n",
    "# Keep track of descriptive counters\n",
    "num_awards = 0\n",
    "num_faculty = 0\n",
    "num_students = 0\n",
    "\n",
    "# visualize the network       \n",
    "\n",
    "# declare variables\n",
    "subgraph_nodes = None\n",
    "color_values = []\n",
    "node_counter = -1\n",
    "node = None\n",
    "py2neo_node = None\n",
    "node_properties_dict = None\n",
    "node_id = 0\n",
    "node_type = None\n",
    "\n",
    "# set colors of nodes:\n",
    "subgraph_nodes = subgraph_graph.nodes( data = True )\n",
    "color_values = calculate_color_values_for_nodes( subgraph_nodes )\n",
    "\n",
    "# loop over nodes to get counts of each type.\n",
    "\n",
    "# use networkx graph.nodes() method to retrieve just list of nodes\n",
    "subgraph_nodes = subgraph_graph.nodes( data = True )\n",
    "\n",
    "# loop over nodes\n",
    "node_counter = 0\n",
    "for node in subgraph_nodes:\n",
    "    \n",
    "    # initialize variables\n",
    "    node_id = 0\n",
    "    node_type = None\n",
    "    \n",
    "    # get the node's properties (still a reference to py2neo.types.Node)\n",
    "    py2neo_node = node[ 0 ]\n",
    "    node_properties_dict = dict( py2neo_node )\n",
    "\n",
    "    #print( \"node[ 0 ] type = \" + str( type( py2neo_node ) ) )\n",
    "    \n",
    "    # Is there an employee ID?\n",
    "    if \"employeeid\" in node_properties_dict:\n",
    "\n",
    "        # yes - it is ID, and also get position.\n",
    "        node_id = node_properties_dict.get( \"employeeid\", None )\n",
    "        node_type = node_properties_dict.get( \"position\", None )\n",
    "\n",
    "    else:\n",
    "\n",
    "        # no employee ID, so award.\n",
    "        node_id = node_properties_dict.get( \"award_num\", None )\n",
    "        node_type = \"AWARD\"\n",
    "        \n",
    "    #-- END check to see if employee ID. --#\n",
    "\n",
    "    # What type?\n",
    "    if node_type == \"FACULTY\":\n",
    "\n",
    "        # FACULTY = green\n",
    "        num_faculty += 1\n",
    "\n",
    "    elif node_type == \"STUDENT\":\n",
    "\n",
    "        # STUDENT = yellow\n",
    "        num_students += 1\n",
    "\n",
    "    else:\n",
    "\n",
    "        # other = AWARD = red\n",
    "        num_awards += 1\n",
    "        \n",
    "    #-- END check to see what type based on position --#\n",
    "    \n",
    "#-- END loop over nodes to get type counts --#\n",
    "        \n",
    "# draw the graph\n",
    "networkx.draw( subgraph_graph, node_color = color_values )\n",
    "\n",
    "# retrieve person data\n",
    "person_data = list(networkx.get_node_attributes( subgraph_graph, 'position' ).values())\n",
    "\n",
    "print( 'Number of Awards: ' + str( num_awards ) )\n",
    "print( 'Number of Students: ' + str( num_students ) )\n",
    "print( 'Number of Faculty: ' + str( num_faculty ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "_________________DEGREE CENTRALITY ________________\n",
      "Highest degree Centrality:(a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}) - 1.0\n",
      "Highest degree Centrality:(a43fe2c:Award {award_num:\"aw1468\"}) - 0.5\n",
      "Highest degree Centrality:(f6b7edd:Award {award_num:\"aw1257\"}) - 0.5\n",
      "_________________Betweenness ________________\n",
      "Highest Betweeness:(a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}) - 1.0\n",
      "Highest Betweeness:(a43fe2c:Award {award_num:\"aw1468\"}) - 0.0\n",
      "Highest Betweeness:(f6b7edd:Award {award_num:\"aw1257\"}) - 0.0\n",
      "_________________Cliques ________________\n",
      "Number of cliques: 2\n",
      "Size of cliques:[2, 2]\n",
      "_________________Diameter ________________\n",
      "Diameter: 2\n",
      "______________________________________________\n"
     ]
    }
   ],
   "source": [
    "print( \"_________________DEGREE CENTRALITY ________________\" )\n",
    "calculate_degree_centrality( subgraph_graph )\n",
    "print( \"_________________Betweenness ________________\" )\n",
    "calculate_betweenness( subgraph_graph )\n",
    "print( \"_________________Cliques ________________\" )\n",
    "find_cliques( subgraph_graph )\n",
    "print( \"_________________Diameter ________________\" )\n",
    "find_diameter( subgraph_graph )\n",
    "print( \"______________________________________________\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Plotting Network Metrics\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Betweeness and Centrality are both measures on how connnected a node is to its surounding nodes. However, they measure connectiveness in slightly different ways. A Node with high Degree centrality does not nessasarily mean the node also has a high level a Betwennness Centrality.\n",
    "\n",
    "   A node with high betweenness but low degree might indicated that a node's few connections are critical to the shape of the graph\n",
    "\n",
    "   A node with high degree but low betweenness might indicate that a node's connections are redundent and connections can bypass that node\n",
    "    \n",
    "    \n",
    "### Exercise - degree vs. betweeness centrality\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "Run the Cell below to create a scatterplot of betweeness vs centrality of our subgraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAYUAAAEWCAYAAACJ0YulAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xu8VVW99/HPVy6JimCClgiChhTmtS1YWppaisdCzc4R\nM9PjcziWmr1OebycnqxHS806pamRecwsL2V6DAtFzdTyygYVBLUIFcEUvABeKAV+zx9j7Nlyuy8T\n2HMt9ub7fr3WizVvY/7GWuz1W2OMucZURGBmZgawQaMDMDOzdYeTgpmZFZwUzMys4KRgZmYFJwUz\nMys4KZiZWcFJwczWmqQrJJ2dn39Y0hONjsnWjJOCvYWkpyQtl/SqpJcl/VbS0JLH7iNpQdUxro8k\nbSrp+5Lm5/fmL3l5UBeU/ZSk/bsiToCI+ENEjKqqfKuWk4K15RMRsQnwbuB54AcNjme9Jqkv8Dtg\nB+BAYFPgg8ALwJg6nL931eewdYeTgrUrIv4G/AoY3bJO0jskfSd/Y31e0iRJ/SRtDNwMbJW/yb4q\naavc6hiUj/0vSSskbZqXz5L0/Y7KrTnvwZIelrRE0r2SdqrZ9pSkr0iaKWmppF9I2jBv20fSAklf\nlrRI0l8lHdtZffK2QZJ+k8/5kqQ/SNogbztV0kJJr0h6QtJ+rV8/SWMlPSepV826QyXNzM/HSGqW\ntCyf+7/beSuOBoYBh0bEnIhYFRGLIuLsiJiSy9pK0vWSFkt6UtIXa875dUm/lHRljne2pKa87We5\n7Jvye/afkoZLCknHSZoP3JH3vS7XZ6mkuyXt0FawtS3Gdsr/raSTWh0zU9Kh7dTf6shJwdolaSPg\nX4D7a1afC2wP7AK8BxgCfC0iXgPGAc9GxCb58SwwDdg7H7s38DSwZ83yXR2Vm+PYFbgc+Hdgc+BH\nwGRJ76iJ659J36JHADsBx9RsexcwIJd5HHCxpM06Oy/wZWABMBjYEjgDCEmjgBOB3SOiP3AA8FTr\n1y8iHgBeA/atWX0kcHV+fgFwQURsCmwH/LJ1Gdn+wC0R8WpbG3Oiugl4JMe/H/AlSQfU7PZJ4Fpg\nIDAZuCjH+FlgPrl1GBHfrjlmb+B9uX6Qkv5IYAtgBnBVO/EW2in/p8BRNfHvnOP+bWflWR1EhB9+\nFA/Sh9urwBLgTeBZYMe8TaQPue1q9v8g8GR+vg+woFV5ZwEXAr2B54CTSR/EGwLLSR/ynZX7Q+Cs\nVuU+AexdE/NRNdu+DUyqiWk50Ltm+yJgjxLn/X/Ar4H3tDr3e3IZ+wN9Onk9zwYuz8/75/Ntk5fv\nBr4BDOqkjNuAczvYPhaY32rd6cBP8vOvA7fXbBsNLG/1nu9fszwcCGDbDs45MO8zIC9fAZzd1v+D\nNsrfEHgZGJmXvwNc0uj/+36kh1sK1pZDImIg6Y/3ROAuSe8ifWPeCJieu1SWALfk9e25i/QhsRsw\ni/QBtzfpQ3luRLxYotxtgC+3bMvbhwJb1ZznuZrnrwOb1Cy/GBEr2tje2XnPB+YCt0qaJ+k0gIiY\nC3yJ9GG7SNK1kmpjqXU1cFhu1RwGzIiIp/O240itlMclTZN0cDtlvEga32nPNqRuu9rX5wxS66ZF\n69dnQ3U+VvBMyxNJvSSdqzTAvYx/tIxWe6A7UrfkL4CjcitnAvCz1S3HquGkYO2KiJURcQOwEtiL\nNLC5HNghIgbmx4BIg9KQvjm2di8wCjgUuCsi5pD6mA/iH11HnZX7DPDNmm0DI2KjiLhmLavY4Xkj\n4pWI+HJEbEvqfvmPlrGDiLg6IvYifSAHcF5bJ8j1fZrUtVbbdURE/DkiJpC6Y84DfqU0NtPa7cAB\n7WyD9Po82er16R8RB5V8HdqbKrl2/ZHAeFLraACpNQGptbUm5f8U+Aypq+v1iLivVKRWOScFa5eS\n8cBmwGMRsQr4MfA9SVvkfYbU9F0/D2wuaUBLGRHxOjAdOIF/JIF7geNblkuU+2Pg+DxwK0kbS/on\nSf3Xpn6dnVdpcPs9kgQsJSXHVZJGSdo3f/v/GymxrOrgVFeTus0+AlzXslLSUZIG5ziW5NVtlfMz\n0gf/9ZLeK2kDSZtLOkPSQcCDwCt58Ltf/lb/fkm7l3wpnge27WSf/sDfSa2WjYBvlSy7zfJzElgF\nfBe3EtYpTgrWlpskvQosA74JfC4iZudtp5K6VO7P3Qi3k1oCRMTjwDXAvNyN0dKlchfQh/Th1bLc\nn9SnTolym4F/Iw2Ovpz3O6aL6trueUmDqreTxljuI/V7/x54B2lc5AVSt8wWpD789lxD6jK7IyJe\nqFl/IDA7v9YXAEdExPLWB0fE30nf0B8ndb8tI72Wg4AHImIlcDBpsPzJHNdlpG/0ZZwDfDW/Z19p\nZ58rSS2ehcAc3nrxwZqWfyWwI/Dz1SjLKqYI32THzOpP0tHAxNwNZ+sItxTMrO7y5c5fAC5tdCz2\nVk4KZlZXecxmMWms4epOdrc6c/eRmZkV3FIwM7NCt5voatCgQTF8+PBGh2Fm1q1Mnz79hYjo6Iem\nQDdMCsOHD6e5ubnRYZiZdSuSnu58L3cfmZlZDScFMzMrOCmYmVnBScHMzApOCmZmVnBSMDOzgpOC\nmZkVnBTMzKxQWVKQdLmkRZIebWe7JF0oaa6kmZJ2qyoWM7Pu4saHFrLnuXcw4rTfsue5d3DjQwvr\nev4qWwpXkG4i0p5xpJuYjAQmkm7Obma23rrxoYWcfsMsFi5ZTgALlyzn9Btm1TUxVJYUIuJu4KUO\ndhkPXBnJ/cBASR3dnNzMrEc7f+oTLH9z5VvWLX9zJedPfaJuMTRyTGEI6b6zLRbkdW8jaaKkZknN\nixcvrktwZmb19uySt92NtcP1VegWA80RcWlENEVE0+DBnU7yZ2bWLW01sN9qra9CI5PCQmBozfLW\neZ2Z2XrplANG0a9Pr7es69enF6ccMKpuMTQyKUwGjs5XIe0BLI2IvzYwHjOzhjpk1yGcc9iODBnY\nDwFDBvbjnMN25JBd2+xZr0Rl91OQdA2wDzBI0gLgTKAPQERMAqYABwFzgdeBY6uKxcysuzhk1yF1\nTQKtVZYUImJCJ9sDOKGq85uZ2errFgPNZmZWH04KZmZWcFIwM7OCk4KZmRWcFMzMrOCkYGZmBScF\nMzMrOCmYmVnBScHMzApOCmZmVnBSMDOzgpOCmZkVnBTMzKzgpGBmZgUnBTMzKzgpmJlZwUnBzMwK\nTgpmZlZwUjAzs4KTgpmZFZwUzMys4KRgZmYFJwUzMys4KZiZWcFJwczMCk4KZmZWcFIwM7OCk4KZ\nmRWcFMzMrFBpUpB0oKQnJM2VdFob2wdIuknSI5JmSzq2ynjMzKxjlSUFSb2Ai4FxwGhggqTRrXY7\nAZgTETsD+wDfldS3qpjMzKxjVbYUxgBzI2JeRLwBXAuMb7VPAP0lCdgEeAlYUWFMZmbWgU6TgqRP\nSFqT5DEEeKZmeUFeV+si4H3As8As4OSIWNVGDBMlNUtqXrx48RqEYmZmZZT5sP8X4M+Svi3pvV18\n/gOAh4GtgF2AiyRt2nqniLg0Ipoiomnw4MFdHIKZmbXoNClExFHArsBfgCsk3Ze/uffv5NCFwNCa\n5a3zulrHAjdEMhd4EujqxGNmZiWV6haKiGXAr0jjAu8GDgVmSDqpg8OmASMljciDx0cAk1vtMx/Y\nD0DSlsAoYN5q1cDMzLpM7852kDQeOAZ4D3AlMCYiFknaCJgD/KCt4yJihaQTgalAL+DyiJgt6fi8\nfRJwFqn1MQsQcGpEvLD21TIzszXRaVIADgO+FxF3166MiNclHdfRgRExBZjSat2kmufPAh8vH66Z\nmVWpTPfRc60TgqTzACLid5VEZWZmDVEmKXysjXXjujoQMzNrvHa7jyR9HvgCsJ2kmTWb+gP3VB2Y\nmZnVX0djClcDNwPnALXzFr0SES9VGpWZmTVER0khIuIpSSe03iDpnU4MZmY9T2cthYOB6aQ5ilSz\nLYBtK4zLzMwaoN2kEBEH539H1C8cMzNrpI4Gmnfr6MCImNH14ZiZWSN11H303Q62BbBvF8diZmYN\n1lH30UfrGYiZmTVemWkukPR+0t3TNmxZFxFXVhWUmZk1RpkJ8c4k3SpzNGkeo3HAH0mT45mZWQ9S\nZpqLw0nTWz8XEccCOwMDKo3KzMwaokxSWJ5vkbki3xVtEW+9eY6ZmfUQZcYUmiUNBH5M+iHbq8B9\nlUZlZmYN0WFSkCTgnIhYAkySdAuwaUTM7Og4MzPrnjpMChERkqYAO+blp+oRlJmZNUaZMYUZknav\nPBIzM2u4MmMKY4HPSHoaeI00MV5ExE6VRmZmZnVXJikcUHkUZma2TijTfXR2RDxd+wDOrjowMzOr\nvzJJYYfaBUm9gA9UE46ZmTVSu0lB0umSXgF2krQsP14h/Xjt13WL0MzM6qbdpBAR50REf+D8iNg0\nP/pHxOYRcXodYzQzszrpdKA5Ik6XNATYpnb/iLi7ysDMzKz+ysySei5wBDAHWJlXB+CkYGbWw5S5\nJPVQYFRE/L3qYMzMrLHKXH00D+hTdSBmZtZ4ZVoKrwMPS/odULQWIuKLlUVlZmYNUSYpTM4PMzPr\n4cpcffRTSf2AYRHxxOoULulA4AKgF3BZRJzbxj77AN8ndVG9EBF7r845zMys63Q6piDpE8DDwC15\neRdJnbYc8i+fLybd03k0MEHS6Fb7DAQuAT4ZETsAn17tGpiZWZcpM9D8dWAMsAQgIh4Gti1x3Bhg\nbkTMi4g3gGuB8a32ORK4ISLm57IXlYzbzMwqUCYpvBkRS1utW1XiuCHAMzXLC/K6WtsDm0m6U9J0\nSUe3VZCkiZKaJTUvXry4xKnNzGxNlEkKsyUdCfSSNFLSD4B7u+j8vUmT6/0TaYru/ytp+9Y7RcSl\nEdEUEU2DBw/uolObmVlrZZLCSaSZUv8OXA0sBb5U4riFwNCa5a3zuloLgKkR8VpEvED6lfTOJco2\nM7MKdDRL6oaSBkfE6xHxXxGxe0TsDlxYsuxpwEhJIyT1JU2V0XqA+tfAXpJ6S9qIdJe3x9agHmZm\n1gU6ailcCHy4jfV7At/rrOCIWAGcCEwlfdD/MiJmSzpe0vF5n8dIVzXNBB4kXbb66OpVwczMuooi\nou0N0vSIaPNmOpJm50tI666pqSmam5sbcWozs24rf6Y3dbZfRy2FjdbwODMz66Y6+nBfJGlM65WS\ndgd8XaiZWQ/U0TQXpwC/lHQFMD2vawKOJg0am5lZD9PR7TgfJP0qWcAx+SFgbEQ8UI/gzMysvjqc\nEC9PO3FmnWIxM7MG84CxmZkVnBTMzKywWklB0gaSNq0qGDMza6wy91O4WtKmkjYGHgXmSDql+tDM\nzKzeyrQURkfEMuAQ4GZgBPDZSqMyM7OGKJMU+kjqQ0oKkyPiTaDtuTHMzKxbK5MUfgQ8BWwM3C1p\nG2BZlUGZmVljdPg7BYCIuJC3Tpf9tKSPVheSmZk1SpmB5pPzQLMk/Y+kGcC+dYjNzMzqrEz30b/m\ngeaPA5uRBpnPrTQqMzNriDJJQfnfg4CfRcTsmnVmZtaDlEkK0yXdSkoKUyX1B1ZVG5aZmTVCpwPN\nwHHALsC8iHhd0ubAsdWGZWZmjVCmpRDAaOCLeXljYMPKIjIzs4YpkxQuAT4ITMjLrwAXVxaRmZk1\nTJnuo7ERsZukhwAi4mVJfSuOy8zMGqBMS+FNSb3IU1tIGowHms3MeqQySeFC4H+BLSR9E/gj8K1K\nozIzs4YoM83FVZKmA/uRfp9wSEQ8VnlkZmZWd2XGFAD+TJoErzeApGERMb+yqMzMrCE6TQqSTgLO\nBJ4HVpJaCwHsVG1oZmZWb2VaCicDoyLixaqDMTOzxioz0PwMsLTqQMzMrPHKtBTmAXdK+i3w95aV\nEfHflUVlZmYNUaalMB+4DegL9K95dErSgZKekDRX0mkd7Le7pBWSDi9TrpmZVaPMJanfWJOC8w/e\nLgY+BiwApkmaHBFz2tjvPODWNTmPmZl1nTJXH20PfAUYXrt/RHR297UxwNyImJfLuRYYD8xptd9J\nwPXA7qWjNjOzSpQZU7gOmARcRroktawhpEHqFguAsbU7SBoCHAp8lA6SgqSJwESAYcOGrUYIZma2\nOsokhRUR8cOKzv994NSIWCW1fzO3iLgUuBSgqakpKorFzGy9VyYp3CTpC6T5j2qvPnqpk+MWAkNr\nlrfO62o1AdfmhDAIOEjSioi4sURcZmbWxcokhc/lf0+pWRfAtp0cNw0YKWkEKRkcARxZu0NEjGh5\nLukK4DdOCGZmjVPm6qMRne3TznErJJ0ITAV6AZdHxGxJx+ftk9akXDMzq06Zq482Av4DGBYREyWN\nJE178ZvOjo2IKcCUVuvaTAYRcUypiM3MrDJlfrz2E+AN4EN5eSFwdmURmZlZw5RJCttFxLeBNwEi\n4nXSTKlmZtbDlEkKb0jqxz9ux7kdNVchmZlZz1Hm6qMzgVuAoZKuAvYEjqkyKDMza4wyVx/dJmkG\nsAep2+jkiHih8sjMzKzuOu0+Uvpl2TjgA/mKo40kjak8MjMzq7syYwqXAB8EJuTlV0izn5qZWQ9T\nZkxhbETsJukhgIh4WVLfiuMyM7MGKNNSeDPf86Dl6qPBwKpKozIzs4YokxQuJE2Gt4WkbwJ/BL5V\naVRmZtYQZa4+ukrSdGA/0tVHh0TEY5VHZmZmdVdm7qOzgLuBKyLitepDMjOzRinTfTSPdOVRs6QH\nJX1X0viK4zIzswboNClExE8i4l9Jt8z8OfDp/K+ZmfUwZbqPLgNGA88DfwAOB2ZUHJeZmTVAme6j\nzUk3yVkCvAS8EBErKo3KzMwaoszVR4cCSHofcADwe0m9ImLrqoMzM7P6KtN9dDDwYeAjwEDgDlI3\nkpmZ9TBlprk4kJQELoiIZyuOx8zMGqjMmMJrEfGL2oQg6bwKYzIzswYpkxQ+1sa6cV0diJmZNV67\n3UeSPg98AdhW0syaTf2Be6oOzMzM6q+jMYWrgZuBc4DTata/EhEvVRqVmZk1RLvdRxGxNCKeiogJ\nwFBg34h4GthA0oi6RWhmZnVT5nacZwKnAqfnVX3xNBdmZj1SmYHmQ4FPAq8B5KuQ+lcZlJmZNUaZ\npPBGRAT/uPPaxtWGZGZmjVImKfxS0o+AgZL+Dbgd+HG1YZmZWSOUmfvoO5I+BiwDRgFfi4jbKo/M\nzMzqrsw0F+QkcJukQcCL1YZkZmaN0m73kaQ9JN0p6QZJu0p6FHgUeF7SgWUKl3SgpCckzZV0Whvb\nPyNppqRZku6VtPOaV8XMzNZWRy2Fi4AzgAGkmVHHRcT9kt4LXAPc0lHBknoBF5OmyVgATJM0OSLm\n1Oz2JLB3RLwsaRxwKTB2jWtjZmZrpaOB5t4RcWtEXAc8FxH3A0TE4yXLHgPMjYh5EfEGcC3wlns7\nR8S9EfFyXrwf8D0azMwaqKOksKrm+fJW26JE2UOAZ2qWF+R17TmONK3G20iaKKlZUvPixYtLnNrM\nzNZER91HO0taBgjol5+TlzfsyiAkfZSUFPZqa3tEXErqWqKpqalMQjIzszXQblKIiF5rWfZC0pxJ\nLbbO695C0k7AZaQxC1/ZZGbWQGV+vLampgEjJY2Q1Bc4Aphcu4OkYcANwGcj4k8VxmJmZiWU+p3C\nmoiIFZJOBKYCvYDLI2K2pOPz9knA14DNgUskAayIiKaqYjIzs44pTWvUfTQ1NUVzc3OjwzAz61Yk\nTS/zpbvK7iMzM+tmnBTMzKzgpGBmZgUnBTMzKzgpmJlZwUnBzMwKTgpmZlZwUjAzs4KTgpmZFZwU\nzMys4KRgZmYFJwUzMys4KZiZWcFJwczMCk4KZmZWcFIwM7OCk4KZmRWcFMzMrOCkYGZmBScFMzMr\nOCmYmVnBScHMzApOCmZmVnBSMDOzgpOCmZkVnBTMzKzgpGBmZgUnBTMzKzgpmJlZoXeVhUs6ELgA\n6AVcFhHnttquvP0g4HXgmIiYUWVMtb564yyueeAZVkbQS2LC2KGcfciO9Tq9mdk6p7KWgqRewMXA\nOGA0MEHS6Fa7jQNG5sdE4IdVxdPaV2+cxc/vn8/KCABWRvDz++fz1Rtn1SsEM7N1TpXdR2OAuREx\nLyLeAK4FxrfaZzxwZST3AwMlvbvCmArXPPDMaq03M1sfVJkUhgC1n7AL8rrV3QdJEyU1S2pevHhx\nlwTX0kIou97MbH3QLQaaI+LSiGiKiKbBgwd3SZm9pNVab2a2PqgyKSwEhtYsb53Xre4+lZgwduhq\nrTczWx9UmRSmASMljZDUFzgCmNxqn8nA0Ur2AJZGxF8rjKlw9iE7ctQew4qWQS+Jo/YY5quPzGy9\nVtklqRGxQtKJwFTSJamXR8RsScfn7ZOAKaTLUeeSLkk9tqp42nL2ITs6CZiZ1aj0dwoRMYX0wV+7\nblLN8wBOqDIGMzMrr1sMNJuZWX04KZiZWcFJwczMCk4KZmZWcFIwM7OCk4KZmRWcFMzMrKDoZhPA\nSVoMPN3FxQ4CXujiMtdF60s9wXXtqVzXNbdNRHQ6eVy3SwpVkNQcEU2NjqNq60s9wXXtqVzX6rn7\nyMzMCk4KZmZWcFJILm10AHWyvtQTXNeeynWtmMcUzMys4JaCmZkVnBTMzKyw3iQFSQdKekLSXEmn\ntbF9H0lLJT2cH19rRJxdobO65n32yfWcLemuesfYVUq8r6fUvKePSlop6Z2NiHVtlajrAEk3SXok\nv691vWlVVylRz80k/a+kmZIelPT+RsTZFSRdLmmRpEfb2S5JF+bXYqak3SoPKiJ6/IN057e/ANsC\nfYFHgNGt9tkH+E2jY61TXQcCc4BheXmLRsddVV1b7f8J4I5Gx13h+3oGcF5+Phh4Cejb6NgrqOf5\nwJn5+XuB3zU67rWo70eA3YBH29l+EHAzIGAP4IGqY1pfWgpjgLkRMS8i3gCuBcY3OKaqlKnrkcAN\nETEfICIW1TnGrrK67+sE4Jq6RNb1ytQ1gP6SBGxCSgor6hvmWitTz9HAHQAR8TgwXNKW9Q2za0TE\n3aT3qT3jgSsjuR8YKOndVca0viSFIcAzNcsL8rrWPpSbaDdL2qE+oXW5MnXdHthM0p2Spks6um7R\nda2y7yuSNgIOBK6vQ1xVKFPXi4D3Ac8Cs4CTI2JVfcLrMmXq+QhwGICkMcA2wNZ1ia7+Sv8f7yqV\n3qO5m5lB6k55VdJBwI3AyAbHVJXewAeA/YB+wH2S7o+IPzU2rEp9ArgnIjr6VtbdHQA8DOwLbAfc\nJukPEbGssWF1uXOBCyQ9TEp+DwErGxtSz7G+tBQWAkNrlrfO6woRsSwiXs3PpwB9JA2qX4hdptO6\nkr5tTI2I1yLiBeBuYOc6xdeVytS1xRF0364jKFfXY0ndghERc4EnSX3u3UnZv9VjI2IX4GjS+Mm8\n+oVYV6vzf7xLrC9JYRowUtIISX1JHxCTa3eQ9K7cF9vSJN0AeLHuka69TusK/BrYS1Lv3K0yFnis\nznF2hTJ1RdIAYG9SvburMnWdT2r9kfvYR9H9PizL/K0OzNsA/g9wdw9sDbWYDBydr0LaA1gaEX+t\n8oTrRfdRRKyQdCIwlXR1w+URMVvS8Xn7JOBw4POSVgDLgSMiD/93J2XqGhGPSboFmAmsAi6LiDYv\niVuXlXxfAQ4Fbo2I1xoU6lorWdezgCskzSJdrXJqbgl2GyXr+T7gp5ICmA0c17CA15Kka0hXPg6S\ntAA4E+gDRV2nkK5Amgu8TmoNVhtTN/zcMzOziqwv3UdmZlaCk4KZmRWcFMzMrOCkYGZmBScFMzMr\nOCnYOi3Patoym+sjkr4saZ35fytpjKS786yeD0m6LP/2Y03KOmMNj7tTUlN+PiVfxz9Q0hfWpDxb\nv60zf1xm7VgeEbtExA7Ax4BxpGu515qkXmt5/JbAdaTfA4yKiF2BW4D+a1hkm0kh/3Cp1N9qRBwU\nEUtIM+E6Kdhqc1KwbiPP5joRODF/UPaSdL6kaXkiw38HkLSBpEskPS7ptvzt+fC87SlJ50maAXxa\n0naSbskTA/5B0nvzfoMlXZ/LniZpzzZCOgH4aUTcVxPjryLieUkbK82V/2BuQYzP5R4j6YZ8zj9L\n+nZefy7QL7eKrpI0PLc+rgQeBYZK+qGk5txq+kZbr1Gu3yDS/EDb5fLOl3SlpENq9ruqJSazt6jn\n3OF++LG6D+DVNtYtAbYkJYiv5nXvAJqBEaRfp08hfel5F/AycHje7yngP2vK+h0wMj8fS77fAnA1\nsFd+Pgx4rI04bgDGtxP3t4Cj8vOBwJ+AjYFjSFNPDAA2BJ4GhrauKzCc9GvzPWrWvTP/2wu4E9gp\nL98JNNXUb1A+/tGaY/cGbszPB5DmRerd6PfXj3XvsV5Mc2E91seBnVpaAaQPu5HAXsB1kaaNfk7S\n71sd9wsASZsAHwKuy9NeQUouAPsDo2vWbyppk8iTJpaM7ZOSvpKXNyQlF0g3hVmaY5hDmvr5mbcX\nwdOR5tBv8c+SJpKmp3k36b4CM8sEExF35dbTYOBTwPUR0d3utWB14KRg3YqkbUnTJC8ize9zUkRM\nbbXPQZ0U0zIH0gbAkkizbba2Aelb+t86KGc2aQrytibaE/CpiHiiVWxjgb/XrFpJ+3+HxVxNkkYA\nXwF2j4iXJV1BSjSr40rgKNIkc93yVp1WPY8pWLeRv+VOAi6KiCBNmvZ5SX3y9u0lbQzcA3wqjy1s\nSZpw7G0izaz5pKRP5+MlqWUK8VuBk2rO3VbiuAj4XP6gb9nvsHzOqcBJUjHz7q4lqvhmS13asCkp\nSSzN5Y/rpKxXePuA9xXAlwAiYk6JeGw95KRg67qWwdfZwO2kD+uWQdbLSPeanqF04/Mfkb51X0+6\nZ8Qc4OekGygtbaf8zwDHSXqE9M2/ZfD1i0BTHsCeAxzf+sCIeJ70rfs7eVD4MdKNbl4hzVjaB5iZ\nYz+rRF0vzftf1ca5HiHdTOZx0njHPR0VFBEvAvdIelTS+TXxPgb8pEQstp7yLKnWI7X0/0vaHHgQ\n2DMinmt0XI2Ufz8xC9itZUzDrDWPKVhP9RtJA4G+wFlOCNof+B/ge04I1hG3FMzMrOAxBTMzKzgp\nmJlZwUnwRBugAAAAFUlEQVTBzMwKTgpmZlZwUjAzs8L/B2CnXsjpwDscAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x118c04d90>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "dc_data = list( networkx.degree_centrality( subgraph_graph ).values() )\n",
    "bw_data = list( networkx.betweenness_centrality( subgraph_graph ).values() )\n",
    "\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "x = dc_data\n",
    "y = bw_data\n",
    "\n",
    "plt.scatter(x, y)\n",
    "\n",
    "#title\n",
    "plt.title(\"Betweenness vs Centrality\")\n",
    "\n",
    "#labels\n",
    "plt.xlabel(\"Degree Centrality\")\n",
    "plt.ylabel(\"Betweenness Centrality\")\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Part 4 - Analysing Graphs\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "### Exercise - function that plots centrality metrics\n",
    "\n",
    "- back to [Table of Contents](#Table-of-Contents)\n",
    "\n",
    "1) Write a function that plots histgrams of the Degree of Centrality and Betweenness for a given graph.  The function should accept a networkx graph as an input parameter and return nothing.\n",
    " \n",
    "2) Use the find_cliques() function to find the number of cliques in the graph \n",
    " \n",
    "3) Based of the graph you created above, the number of cliques, and the histograms of Centrality and Betweenness, how would you discribe the community this graph represents? \n",
    " \n",
    "Hint: Use networkx documentation to find a function that allows you to collect the attributes of a node "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAX4AAAEWCAYAAABhffzLAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAGlFJREFUeJzt3X+YXVVh7vHva0hUfkiEjOBNiEGN1oiA3GngUVrgVmhA\nuSlV+yRVqTxyI1xR21prrvdeuK1tHyy97aMFjVHTwJUfreWHsQ0gWDUKIhloCEkAjRElkZoAyi+p\nGHzvH3uPPQxn5uyZOTMnw3o/z3OenLPW2muvlUne2WeffdaWbSIiohzP6fUAIiJiciX4IyIKk+CP\niChMgj8iojAJ/oiIwiT4IyIKk+CPmKIkvVPSN1pePybppb0cU0wNCf6YMJLulfSEpEcl/UTSzZLO\nkjQl/t2p8j5JmyQ9Lmm7pM9Lek0X+l4t6c+6Mc5Btve1vW2i+o9njynxHzCmtFNt7we8BDgf+BDw\n2YnYkaRpXe7yY8D7gfcBBwCvAK4B3tjl/TyDpL0meh9RMNt55DEhD+Be4A1DyhYCvwAOq18/F/gr\n4AfAj4AVwPNb2v8xcD/wQ+BMwMDL67rVwCeBtcDjwBsa9PcmYAPwE+Bm4PBhxj4feApYOML8ht0X\ncDywHfgAsLOewxl13TLg58CTwGPAF1v+vj4EbAR+BuwFLAe+CzwKbAFOa9n/O4FvtLw28PJ2/QMf\nBK4cMv6PAx/r9b+TPCb/kSP+mFS2b6UKxF+ri86nOpI+kiq0ZgPnAkhaBPwhVaC/nCpMh/pd4M+B\n/YBvdOjvtcAq4N3AgcCngDWSntum398AttfjHc6w+6odDOxfl78LuEjSC22vBC4F/tLV6ZlTW7ZZ\nSvWOYqbt3VSh/2t1P38CfE7Si0cYE8P0/zlgkaSZ9d/FXsAS4JKR+opnpwR/9MIPgQMkiero9A9s\nP2T7UeAvqAIJ4HeAv7O92fZPgf/Tpq8v2L7J9i+ojpJH6m8Z8Cnb37L9lO2L622OadPvgVRH6W01\nGDtUR91/avvnttdSHX2/ssPfzcdt32f7CQDbn7f9Q9u/sP33wHeo3jWNiu37gXXAW+uiRcADtm8b\nbV8x9eU8YvTCbOAhoA/YG7itylEABAyeq/9PwEDLdve16au1rFN/LwF+T9J7W7aZUe9nqAeBkY6s\nO+0L4MH6qH3QT4F9R+gThsxR0ulU73rm1UX7ArM69DGci4GzgU8Dbwf+3xj7iSkuR/wxqST9KlXw\nfwN4AHgCeLXtmfVjf9uD4Xg/MKdl80PadNm6vGyn/u4D/rylbqbtvW1f3qbfLwNzJPUPM5VO++pk\nuGVxf1ku6SVUIX0OcKDtmcAmql8wY+n/GuBwSYdRfdZxacOxxrNMgj8mhaQXSHoTcAXwOdt31qdn\nPg38jaQX1e1mS/rNerN/AM6Q9CpJewP/e6R9NOjv08BZko6uL9XcR9IbJe3Xpq/vAJ8ALpd0vKQZ\nkp4naYmk5Q321cmPgE7X3O9DFeC76v7PAA4ba/+2/x34R+Ay4FbbP2jYVzzLJPhjon1R0qNUR9v/\nE/hr4IyW+g8BW4FbJD0C3Eh9Htz2tVRXnnxlsE29zc9G2N9I/Q0A/w24EPhx3e6dI/T1vrrtRVRX\nAX0XOI3qKpkR99XAZ4EF9fcbrmnXwPYW4P8C36QK8tcAN42z/4vrfnKap2CycyOWmBokvYrqVMdz\nh5w7j4YkzQXuBg62/UivxxO9kSP+2KNJOk3ScyW9EPgo1TXvCf0xqL8x/YfAFQn9siX4Y0/3bqov\nQH2X6gtVZ/d2OFOTpH2AR4ATgfN6PJzosZzqiYgoTI74IyIKs0d+gWvWrFmeN29er4cRETFl3Hbb\nbQ/Y7mvSdo8M/nnz5jEwMNC5YUREACDp+03b5lRPRERhEvwREYVJ8EdEFCbBHxFRmAR/RERhEvwR\nEYXpGPySDpH0FUlbJG2W9P42bSTp45K2Stoo6aiWukWS7qnrlnd7AhERMTpNjvh3Ax+wvYDqFnXv\nkbRgSJuTqW5OPZ/qdnSfBJA0jWpJ25OBBcDSNttGRMQk6hj8tu+3fXv9/FHgLqo7KLVaDFziyi3A\nzPqG0AuBrba32X6S6iYci7s6g4iIGJVRfXNX0jzgtcC3hlTN5un3Ct1el7UrP3qYvpdRvVtg7ty5\noxnW08xb/s9j3nY87j3/jT3Zb0TEaDX+cFfSvsCVwO9PxFretlfa7rfd39fXaLmJiIgYg0ZH/JKm\nU4X+pbavatNkB0+/Efacumz6MOUREdEjTa7qEdX9O++y/dfDNFsDnF5f3XMM8LDt+4H1wHxJh0qa\nASyp20ZERI80OeJ/PfAO4E5JG+qyDwNzAWyvANYCp1DdePqn1DfTtr1b0jnA9cA0YJXtzV2dQURE\njErH4Lf9DUAd2hh4zzB1a6l+MURExB4g39yNiChMgj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ\n/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIK0/FGLJJW\nAW8Cdto+rE39B4G3tfT3KqDP9kOS7gUeBZ4Cdtvu79bAIyJibJoc8a8GFg1XafsC20faPhL4H8DX\nbD/U0uSEuj6hHxGxB+gY/LbXAQ91aldbClw+rhFFRMSE6to5fkl7U70zuLKl2MCNkm6TtKxb+4qI\niLHreI5/FE4FbhpymudY2zskvQi4QdLd9TuIZ6h/MSwDmDt3bheHFRERrbp5Vc8Shpzmsb2j/nMn\ncDWwcLiNba+03W+7v6+vr4vDioiIVl0Jfkn7A8cBX2gp20fSfoPPgZOATd3YX0REjF2TyzkvB44H\nZknaDpwHTAewvaJudhrwJduPt2x6EHC1pMH9XGb7uu4NPSIixqJj8Nte2qDNaqrLPlvLtgFHjHVg\nERExMfLN3YiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIK\nk+CPiChMgj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwnQMfkmrJO2U1PZ+uZKOl/SwpA31\n49yWukWS7pG0VdLybg48IiLGpskR/2pgUYc2X7d9ZP34UwBJ04CLgJOBBcBSSQvGM9iIiBi/jsFv\nex3w0Bj6Xghstb3N9pPAFcDiMfQTERFd1K1z/K+TtFHStZJeXZfNBu5rabO9LmtL0jJJA5IGdu3a\n1aVhRUTEUN0I/tuBubYPB/4WuGYsndheabvfdn9fX18XhhUREe2MO/htP2L7sfr5WmC6pFnADuCQ\nlqZz6rKIiOihcQe/pIMlqX6+sO7zQWA9MF/SoZJmAEuANePdX0REjM9enRpIuhw4HpglaTtwHjAd\nwPYK4C3A2ZJ2A08AS2wb2C3pHOB6YBqwyvbmCZlFREQ01jH4bS/tUH8hcOEwdWuBtWMbWkRETIR8\nczciojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIK\nk+CPiChMgj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojAdg1/SKkk7JW0apv5tkjZKulPSzZKOaKm7\nty7fIGmgmwOPiIixaXLEvxpYNEL994DjbL8G+Aiwckj9CbaPtN0/tiFGREQ3Nbnn7jpJ80aov7nl\n5S3AnPEPKyIiJkq3z/G/C7i25bWBGyXdJmnZSBtKWiZpQNLArl27ujysiIgY1PGIvylJJ1AF/7Et\nxcfa3iHpRcANku62va7d9rZXUp8m6u/vd7fGFRERT9eVI35JhwOfARbbfnCw3PaO+s+dwNXAwm7s\nLyIixm7cwS9pLnAV8A7b324p30fSfoPPgZOAtlcGRUTE5Ol4qkfS5cDxwCxJ24HzgOkAtlcA5wIH\nAp+QBLC7voLnIODqumwv4DLb103AHCIiYhSaXNWztEP9mcCZbcq3AUc8c4uIiOilfHM3IqIwCf6I\niMIk+CMiCpPgj4goTII/IqIwCf6IiMIk+CMiCpPgj4goTII/IqIwCf6IiMIk+CMiCpPgj4goTII/\nIqIwCf6IiMIk+CMiCpPgj4goTII/IqIwHYNf0ipJOyW1vV+uKh+XtFXSRklHtdQtknRPXbe8mwOP\niIixaXLEvxpYNEL9ycD8+rEM+CSApGnARXX9AmCppAXjGWxERIxfx+C3vQ54aIQmi4FLXLkFmCnp\nxcBCYKvtbbafBK6o20ZERA91vNl6A7OB+1peb6/L2pUfPVwnkpZRvWNg7ty5XRhWRMTYzFv+zz3Z\n773nv3FS9rPHfLhre6Xtftv9fX19vR5ORMSzVjeO+HcAh7S8nlOXTR+mPCIieqgbR/xrgNPrq3uO\nAR62fT+wHpgv6VBJM4AldduIiOihjkf8ki4HjgdmSdoOnEd1NI/tFcBa4BRgK/BT4Iy6brekc4Dr\ngWnAKtubJ2AOERExCh2D3/bSDvUG3jNM3VqqXwwREbGH2GM+3I2IiMmR4I+IKEyCPyKiMAn+iIjC\nJPgjIgqT4I+IKEyCPyKiMAn+iIjCJPgjIgqT4I+IKEyCPyKiMAn+iIjCJPgjIgqT4I+IKEyCPyKi\nMAn+iIjCJPgjIgrTKPglLZJ0j6Stkpa3qf+gpA31Y5OkpyQdUNfdK+nOum6g2xOIiIjRaXLP3WnA\nRcCJwHZgvaQ1trcMtrF9AXBB3f5U4A9sP9TSzQm2H+jqyCMiYkyaHPEvBLba3mb7SeAKYPEI7ZcC\nl3djcBER0X1Ngn82cF/L6+112TNI2htYBFzZUmzgRkm3SVo23E4kLZM0IGlg165dDYYVERFj0e0P\nd08FbhpymudY20cCJwPvkfTr7Ta0vdJ2v+3+vr6+Lg8rIiIGNQn+HcAhLa/n1GXtLGHIaR7bO+o/\ndwJXU506ioiIHmkS/OuB+ZIOlTSDKtzXDG0kaX/gOOALLWX7SNpv8DlwErCpGwOPiIix6XhVj+3d\nks4BrgemAatsb5Z0Vl2/om56GvAl24+3bH4QcLWkwX1dZvu6bk4gIiJGp2PwA9heC6wdUrZiyOvV\nwOohZduAI8Y1woiI6Kp8czciojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIKk+CPiChM\ngj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojAJ/oiIwiT4IyIKk+CPiChMgj8iojCNgl/SIkn3SNoq\naXmb+uMlPSxpQ/04t+m2ERExuTreelHSNOAi4ERgO7Be0hrbW4Y0/brtN41x24iImCRNjvgXAltt\nb7P9JHAFsLhh/+PZNiIiJkCT4J8N3NfyentdNtTrJG2UdK2kV49yWyQtkzQgaWDXrl0NhhUREWPR\nrQ93bwfm2j4c+FvgmtF2YHul7X7b/X19fV0aVkREDNUk+HcAh7S8nlOX/ZLtR2w/Vj9fC0yXNKvJ\nthERMbmaBP96YL6kQyXNAJYAa1obSDpYkurnC+t+H2yybURETK6OV/XY3i3pHOB6YBqwyvZmSWfV\n9SuAtwBnS9oNPAEssW2g7bYTNJeIiGigY/DDL0/frB1StqLl+YXAhU23jYiI3sk3dyMiCpPgj4go\nTII/IqIwCf6IiMIk+CMiCpPgj4goTII/IqIwCf6IiMIk+CMiCpPgj4goTII/IqIwCf6IiMIk+CMi\nCpPgj4goTII/IqIwCf6IiMIk+CMiCtMo+CUtknSPpK2Slrepf5ukjZLulHSzpCNa6u6tyzdIGujm\n4CMiYvQ63npR0jTgIuBEYDuwXtIa21tamn0POM72jyWdDKwEjm6pP8H2A10cd0REjFGTI/6FwFbb\n22w/CVwBLG5tYPtm2z+uX94CzOnuMCMioluaBP9s4L6W19vrsuG8C7i25bWBGyXdJmnZcBtJWiZp\nQNLArl27GgwrIiLGouOpntGQdAJV8B/bUnys7R2SXgTcIOlu2+uGbmt7JdUpIvr7+93NcUVExH9o\ncsS/Azik5fWcuuxpJB0OfAZYbPvBwXLbO+o/dwJXU506ioiIHmkS/OuB+ZIOlTQDWAKsaW0gaS5w\nFfAO299uKd9H0n6Dz4GTgE3dGnxERIxex1M9tndLOge4HpgGrLK9WdJZdf0K4FzgQOATkgB22+4H\nDgKursv2Ai6zfd2EzCQiIhppdI7f9lpg7ZCyFS3PzwTObLPdNuCIoeUREdE7+eZuRERhEvwREYVJ\n8EdEFCbBHxFRmAR/RERhEvwREYVJ8EdEFCbBHxFRmAR/RERhEvwREYVJ8EdEFCbBHxFRmAR/RERh\nEvwREYVJ8EdEFCbBHxFRmAR/RERhGgW/pEWS7pG0VdLyNvWS9PG6fqOko5puGxERk6tj8EuaBlwE\nnAwsAJZKWjCk2cnA/PqxDPjkKLaNiIhJ1OSIfyGw1fY2208CVwCLh7RZDFziyi3ATEkvbrhtRERM\noiY3W58N3NfyejtwdIM2sxtuC4CkZVTvFgAek3RPg7G1Mwt4YIzbjpk+Otl7fJqezLnHSptzafOF\nAuesj45rzi9p2rBJ8E8K2yuBlePtR9KA7f4uDGnKyJyf/UqbL2TOE6lJ8O8ADml5Pacua9JmeoNt\nIyJiEjU5x78emC/pUEkzgCXAmiFt1gCn11f3HAM8bPv+httGRMQk6njEb3u3pHOA64FpwCrbmyWd\nVdevANYCpwBbgZ8CZ4y07YTM5D+M+3TRFJQ5P/uVNl/InCeMbE/GfiIiYg+Rb+5GRBQmwR8RUZgp\nGfwNlpA4XtLDkjbUj3N7Mc5uarL0RT3vDZI2S/raZI+x2xr8nD/Y8jPeJOkpSQf0Yqzd0mDO+0v6\noqQ76p/zGb0YZzc1mPMLJV1dLwdzq6TDejHObpG0StJOSZuGqR92CZyusT2lHlQfEn8XeCkwA7gD\nWDCkzfHAP/V6rJM855nAFmBu/fpFvR73RM95SPtTgX/p9bgn4ef8YeCj9fM+4CFgRq/HPsFzvgA4\nr37+K8CXez3ucc7514GjgE3D1J8CXAsIOAb4VrfHMBWP+EtcBqLJnH8XuMr2DwBs75zkMXbbaH/O\nS4HLJ2VkE6fJnA3sJ0nAvlTBv3tyh9lVTea8APgXANt3A/MkHTS5w+we2+uofm7DGW4JnK6ZisE/\n3PIQQ72ufpt0raRXT87QJkyTOb8CeKGkr0q6TdLpkza6idH054ykvYFFwJWTMK6J1GTOFwKvAn4I\n3Am83/YvJmd4E6LJnO8AfhtA0kKqpQnmTMroeqPxv/2x2mOWbOiy26lOeTwm6RTgGqqVQ5/N9gL+\nM/AbwPOBb0q6xfa3ezusSXEqcJPtkY6ini1+E9gA/BfgZcANkr5u+5HeDmtCnQ98TNIGql92/wo8\n1dshTW1T8Yi/4xISth+x/Vj9fC0wXdKsyRti1zVZNmM7cL3tx20/AKwDjpik8U2EJnMetISpf5oH\nms35DKpTera9Ffge1Xnvqarp/+czbB8JnE712ca2yRvipBvNv/0xmYrB33EZCEkH1+dAB98aPgd4\ncNJH2j1Nlr74AnCspL3qUx9HA3dN8ji7qdFyH5L2B46jmv9U12TOP6B6V0d9nvuVTO0QbPL/eWZd\nB3AmsO5Z/g5nuCVwumbKnepxsyUk3gKcLWk38ASwxPXH5VNRkznbvkvSdcBG4BfAZ2y3vVxsKmj4\ncwY4DfiS7cd7NNSuaTjnjwCrJd1JddXHh+p3eFNSwzm/CrhYkoHNwLt6NuAukHQ51ZWHsyRtB86j\nWtBycL5tl8Dp6himcB5GRMQYTMVTPRERMQ4J/oiIwiT4IyIKk+CPiChMgj8iojAJ/ui5elXNwVVF\n75D0AUl7zL9NSQslratXkPxXSZ+pvysxlr4+PMbtviqpv36+tr62faak/z6W/qJse8x/rijaE7aP\ntP1q4ETgZKprm8dN0rRxbn8Q8Hmq6+Vfafu1wHXAfmPssm3w11/WafT/0fYptn9CtSJrgj9GLcEf\ne5R6VdFlwDl1GE6TdIGk9fWie+8GkPQcSZ+QdLekG+qj4LfUdfdK+qik24G3SnqZpOvqxeu+LulX\n6nZ9kq6s+14v6fVthvQe4GLb32wZ4z/a/pGkfVStrX5r/U5gcd3vOyVdVe/zO5L+si4/H3h+/e7m\nUknz6ncRlwCbgEMkfVLSQP3u50/a/R3V85tFtYbNy+r+LpB0iaTfaml36eCYIp6ml+tS55GHbYDH\n2pT9BDiI6pfA/6rLngsMAIdSfTt7LdXBy8HAj4G31O3uBf64pa8vA/Pr50dTr9sPXAYcWz+fC9zV\nZhxXAYuHGfdfAG+vn88Evg3sA7yTahmF/YHnAd8HDhk6V2Ae1besj2kpO6D+cxrwVeDw+vVXgf6W\n+c2qt9/Usu1xwDX18/2p1vHZq9c/3zz2vMeUW7IhinMScPjg0TxVoM0HjgU+72pJ4n+T9JUh2/09\ngKR9gdcBn6+Xb4LqFwjAG4AFLeUvkLSv6wX+Go7tv0r6o/r186h+gUB1s5CH6zFsoVpK+L5ndsH3\nXa25Puh3JC2jWk7lxVRr0W9sMhjbX6vfBfUBbwautD2V1+qPCZLgjz2OpJdSLbu7k2o9mvfavn5I\nm1M6dDO4ds9zgJ+4WtlxqOdQHW3/+wj9bKZa7rrdInAC3mz7niFjOxr4WUvRUwz/f+2XawxJOhT4\nI+BXbf9Y0mqqXyajcQnwdqrFzqb8bRljYuQcf+xR6qPVFcCFtk21eNfZkqbX9a+QtA9wE/Dm+lz/\nQVSLXj2Dq1UcvyfprfX2kjS4XPWXgPe27LvdL4cLgd+rw3yw3W/X+7weeK/0y5VgX9tgij8fnEsb\nL6D6RfBw3f/JHfp6lGd+yLwa+H0A21sajCcKlOCPPcHgB56bgRupAnnwg83PUN1L+HZVN6f+FNXR\n85VU9yDYAnyO6uY7Dw/T/9uAd0m6g+oIfvADz/cB/fWHxluAs4ZuaPtHVEfPf1V/EHsX1c1QHqVa\nKXM6sLEe+0cazHVl3f7SNvu6g+omI3dTff5w00gd2X4QuEnVjeYvaBnvXcDfNRhLFCqrc8aUNXg+\nXtKBwK3A623/W6/H1Uv19wvuBI4a/IwhYqic44+p7J8kzQRmAB9J6OsNwGeBv0nox0hyxB8RUZic\n44+IKEyCPyKiMAn+iIjCJPgjIgqT4I+IKMz/B3gV4mhwxlFEAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x118bee910>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAX4AAAEWCAYAAABhffzLAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHAJJREFUeJzt3X+YXVVh7vHva0gEQgAlA0ogBm38ERRQx4AWS6iKSdSm\nXHlqUgTrj+aiotWnWNH2Aesv4OHaehE0Rm8K2BK8FdCgAQS1hAKRJDYGgsTGkEpSNBGQ38oNvPeP\nvUaP40zOnpkzM5ns9/M855m9195rn7Umed5ZZ51z1pZtIiKiOZ422g2IiIiRleCPiGiYBH9ERMMk\n+CMiGibBHxHRMAn+iIiGSfBHNJCkiyV9smy/WtKG0W5TjJwEf7QlabOkxyU9IukBSd+SdGjNurMk\nbRnuNu5qJO0r6bOSflp+bz8p+5M7cO3Nkl7biXYC2L7J9guG6/qx60nwR11vsr0P8Gzg58DnRrk9\nuyxJE4DvAIcDs4F9gVcCvwBmjsDz7zHczxFjW4I/BsT2r4CvATN6yiQ9XdL/KqPbn0taJGkvSROB\na4CDy6j3EUkHl1cPk0vdv5W0Q9K+Zf8Tkj67s+u2PO8bJa2V9EtJt0g6ouXYZklnSFon6UFJX5W0\nZ826H5a0VdLDkjZIek0pnylptaSHSnv+oZ9f06nAVOBE23fafsr2NtuftL28XOtgSVdI2i7pbknv\nb3n+j0n6v5IuLW1YL6m7HPtKufbV5ff5N5KmSbKkd0r6KfDdcu6/SvpZ6f8KSYf31djWV2X9XP9b\nkt7Xq846SSf20//Y1dnOI4+dPoDNwGvL9t7AJcClLcf/EVgGPBOYBFwNnFOOzQK29LreCuDNZfvb\nwE+AOS3HTqxx3ZcC24CjgXHA20o7n97S5tuAg0v9HwGntasLvAC4Bzi4nDsNeF7ZvhU4pWzvAxzT\nz+/rcuCSnfw+nwasAc4CJgDPBTYBry/HPwb8Cphb2ncOsLKvf4+WNhq4FJgI7FXK31F+b08HPgus\nbalzMfDJvv6N+rj+nwHfb9k/ErgPmDDa/zfzGNwjI/6o6+uSfgk8CLwOOB9AkoCFwAdt32/7YeDT\nwPydXOtG4LgyJXEEcEHZ3xN4BbCixnUXAl+0/X3bT9q+BPg1cEzL81xg+79t30/1R+OoGnWfpArK\nGZLG295s+yel3v8D/kDSZNuP2F7ZT/8OAO7dSf9fAXTZ/rjtJ2xvAr7U63f277aX234S+ApV2Lbz\nMduP2n4cwPYS2w/b/jXVH5MjJe1X4zq9LQOeL2l62T8F+KrtJwZxrdgFJPijrj+1vT+wJ3A6cKOk\nZwFdVK8C1pRpk18C15by/txINcp8GXA7cD1wHFXwbrR9X43rPgf4655j5fihVCP8Hj9r2X6MapS+\n07q2NwIfoArKbZIul9RzzXcCzwfukrRK0hv76d99VO+F9Oc5VNNfrc//UeCgnbR9zxpz9/f0bEga\nJ+nc8qbyQ1SjeIABv7nsanrvq8BbJT0NWED1xyjGqAR/DEgZIV9JNTI+luoNy8eBw23vXx77uXoj\nGKopiN5uoZpSORG40fadVPPKc6n+KFDjuvcAn2o5tr/tvW0vrdGNnda1fZntY6kC2sB5pfw/bS8A\nDixlXyvvY/R2A/D6fo71PP/dvZ5/ku25NdoOff9Oe5f/OTAPeC2wH9V0EIAGef1LgJOB1wCP2b61\nVktjl5TgjwFRZR7wDOBHtp+imqb4R0kHlnOmSHp9qfJz4IDWKQbbj1HNcb+X3wb9LcBpPfs1rvsl\n4DRJR5c2TZT0BkmTanSj37qSXiDpjyU9nWqe/XHgqfL8b5XUVdr2y3Ktp/q4/leowv0KSS+U9DRJ\nB0j6qKS5VO89PFzeRN6rjM5fLOkVNdoO1e/0uW3OmUQ1fXUf1SunT9e8dp/XL0H/FPAZMtof8xL8\nUdfVkh4BHgI+BbzN9vpy7MPARmBlmVa4gWpEj+27gKXApjKt0TNtciMwnioEe/YnUb25S43rrgb+\nErgQeKCc9xd1OtKm7tOBc6lecfyManT/kXJsNrC+/B7+NzC/Zz691/V/TTXSvotqGuuh0s/JVG+S\nPgm8keo9h7vLc32ZamRexznA35Xf5xn9nHMp8F/AVuBOoL/3IwZy/UuBlwD/PIBrxS5Idm7EEhHt\nSToVWFimwWIMy4g/ItqStDfwHmDxaLclhi7BHxE7Vd5X2U4193/ZKDcnOiBTPRERDZMRf0REw+yS\nizlNnjzZ06ZNG+1mRESMGWvWrPmF7Z19cfI3dsngnzZtGqtXrx7tZkREjBmS/qvuuZnqiYhomAR/\nRETDJPgjIhomwR8R0TAJ/oiIhknwR0Q0TNvgl3SopO9JurPc+/Ov+jhHki6QtLHci/NlLcdmq7pv\n6UZJZ3a6AxERMTB1Rvw7gL+2PYPqDknvlTSj1zlzgOnlsRD4AlR3AQIuKsdnAAv6qBsRESOobfDb\nvtf2D8r2w1Q3rZ7S67R5VDffdrkP6f6Sng3MpLqV3qZyf87Ly7kRETFKBvTNXUnTgJcC3+91aAot\n9/sEtpSyvsqP7ufaC6leLTB16tSBNOt3TDvzW4OuOxSbz33DqDxvRMRA1X5zV9I+wBXAB2w/1OmG\n2F5su9t2d1dXreUmIiJiEGqN+CWNpwr9fyk32u5tK3Boy/4hpWx8P+URETFK6nyqR8D/obqx9j/0\nc9oy4NTy6Z5jgAdt3wusAqZLOkzSBGB+OTciIkZJnRH/HwKnALdLWlvKPgpMBbC9CFgOzKW6afVj\nwNvLsR2STgeuA8YBS1pu0B0REaOgbfDb/ndAbc4x8N5+ji2n+sMQERG7gHxzNyKiYRL8ERENk+CP\niGiYBH9ERMMk+CMiGibBHxHRMAn+iIiGSfBHRDRMgj8iomES/BERDZPgj4homAR/RETDJPgjIhom\nwR8R0TAJ/oiIhknwR0Q0TNsbsUhaArwR2Gb7xX0c/xBwcsv1XgR02b5f0mbgYeBJYIft7k41PCIi\nBqfOiP9iYHZ/B22fb/so20cBHwFutH1/yynHl+MJ/YiIXUDb4Le9Ari/3XnFAmDpkFoUERHDqmNz\n/JL2pnplcEVLsYEbJK2RtLBTzxUREYPXdo5/AN4E3NxrmudY21slHQhcL+mu8gri95Q/DAsBpk6d\n2sFmRUREq05+qmc+vaZ5bG8tP7cBVwEz+6tse7HtbtvdXV1dHWxWRES06kjwS9oPOA74RkvZREmT\neraBE4A7OvF8ERExeHU+zrkUmAVMlrQFOBsYD2B7UTntRODbth9tqXoQcJWknue5zPa1nWt6REQM\nRtvgt72gxjkXU33ss7VsE3DkYBsWERHDI9/cjYhomAR/RETDJPgjIhomwR8R0TAJ/oiIhknwR0Q0\nTII/IqJhEvwREQ2T4I+IaJgEf0REwyT4IyIaJsEfEdEwCf6IiIZJ8EdENEyCPyKiYRL8ERENk+CP\niGiYtsEvaYmkbZL6vF+upFmSHpS0tjzOajk2W9IGSRslndnJhkdExODUGfFfDMxuc85Nto8qj48D\nSBoHXATMAWYACyTNGEpjIyJi6NoGv+0VwP2DuPZMYKPtTbafAC4H5g3iOhER0UGdmuN/laR1kq6R\ndHgpmwLc03LOllLWJ0kLJa2WtHr79u0dalZERPTWieD/ATDV9hHA54CvD+Yithfb7rbd3dXV1YFm\nRUREX4Yc/LYfsv1I2V4OjJc0GdgKHNpy6iGlLCIiRtGQg1/SsySpbM8s17wPWAVMl3SYpAnAfGDZ\nUJ8vIiKGZo92J0haCswCJkvaApwNjAewvQg4CXi3pB3A48B82wZ2SDoduA4YByyxvX5YehEREbW1\nDX7bC9ocvxC4sJ9jy4Hlg2taREQMh3xzNyKiYRL8ERENk+CPiGiYBH9ERMMk+CMiGibBHxHRMAn+\niIiGSfBHRDRMgj8iomES/BERDZPgj4homAR/RETDJPgjIhomwR8R0TAJ/oiIhknwR0Q0TII/IqJh\n2ga/pCWStkm6o5/jJ0taJ+l2SbdIOrLl2OZSvlbS6k42PCIiBqfOiP9iYPZOjt8NHGf7JcAngMW9\njh9v+yjb3YNrYkREdFKde+6ukDRtJ8dvadldCRwy9GZFRMRw6fQc/zuBa1r2DdwgaY2khTurKGmh\npNWSVm/fvr3DzYqIiB5tR/x1STqeKviPbSk+1vZWSQcC10u6y/aKvurbXkyZJuru7nan2hUREb+r\nIyN+SUcAXwbm2b6vp9z21vJzG3AVMLMTzxcREYM35OCXNBW4EjjF9o9byidKmtSzDZwA9PnJoIiI\nGDltp3okLQVmAZMlbQHOBsYD2F4EnAUcAHxeEsCO8gmeg4CrStkewGW2rx2GPkRExADU+VTPgjbH\n3wW8q4/yTcCRv18jIiJGU765GxHRMAn+iIiGSfBHRDRMgj8iomES/BERDZPgj4homAR/RETDJPgj\nIhomwR8R0TAJ/oiIhknwR0Q0TII/IqJhEvwREQ2T4I+IaJgEf0REwyT4IyIaJsEfEdEwbYNf0hJJ\n2yT1eb9cVS6QtFHSOkkvazk2W9KGcuzMTjY8IiIGp86I/2Jg9k6OzwGml8dC4AsAksYBF5XjM4AF\nkmYMpbERETF0bYPf9grg/p2cMg+41JWVwP6Sng3MBDba3mT7CeDycm5ERIyitjdbr2EKcE/L/pZS\n1lf50f1dRNJCqlcMTJ06tQPNiogYnGlnfmtUnnfzuW8YkefZZd7ctb3Ydrft7q6urtFuTkTEbqsT\nI/6twKEt+4eUsvH9lEdExCjqxIh/GXBq+XTPMcCDtu8FVgHTJR0maQIwv5wbERGjqO2IX9JSYBYw\nWdIW4Gyq0Ty2FwHLgbnARuAx4O3l2A5JpwPXAeOAJbbXD0MfIiJiANoGv+0FbY4beG8/x5ZT/WGI\niIhdxC7z5m5ERIyMBH9ERMMk+CMiGibBHxHRMAn+iIiGSfBHRDRMgj8iomES/BERDZPgj4homAR/\nRETDJPgjIhomwR8R0TAJ/oiIhknwR0Q0TII/IqJhEvwREQ2T4I+IaJhawS9ptqQNkjZKOrOP4x+S\ntLY87pD0pKRnlmObJd1ejq3udAciImJg6txzdxxwEfA6YAuwStIy23f2nGP7fOD8cv6bgA/avr/l\nMsfb/kVHWx4REYNSZ8Q/E9hoe5PtJ4DLgXk7OX8BsLQTjYuIiM6rE/xTgHta9reUst8jaW9gNnBF\nS7GBGyStkbSwvyeRtFDSakmrt2/fXqNZERExGJ1+c/dNwM29pnmOtX0UMAd4r6Q/6qui7cW2u213\nd3V1dbhZERHRo07wbwUObdk/pJT1ZT69pnlsby0/twFXUU0dRUTEKKkT/KuA6ZIOkzSBKtyX9T5J\n0n7AccA3WsomSprUsw2cANzRiYZHRMTgtP1Uj+0dkk4HrgPGAUtsr5d0Wjm+qJx6IvBt24+2VD8I\nuEpSz3NdZvvaTnYgIiIGpm3wA9heDizvVbao1/7FwMW9yjYBRw6phRER0VH55m5ERMMk+CMiGibB\nHxHRMAn+iIiGSfBHRDRMgj8iomES/BERDZPgj4homAR/RETDJPgjIhomwR8R0TAJ/oiIhknwR0Q0\nTII/IqJhEvwREQ2T4I+IaJgEf0REw9QKfkmzJW2QtFHSmX0cnyXpQUlry+OsunUjImJktb31oqRx\nwEXA64AtwCpJy2zf2evUm2y/cZB1IyJihNQZ8c8ENtreZPsJ4HJgXs3rD6VuREQMgzrBPwW4p2V/\nSynr7VWS1km6RtLhA6yLpIWSVktavX379hrNioiIwejUm7s/AKbaPgL4HPD1gV7A9mLb3ba7u7q6\nOtSsiIjorU7wbwUObdk/pJT9hu2HbD9StpcD4yVNrlM3IiJGVp3gXwVMl3SYpAnAfGBZ6wmSniVJ\nZXtmue59depGRMTIavupHts7JJ0OXAeMA5bYXi/ptHJ8EXAS8G5JO4DHgfm2DfRZd5j6EhERNbQN\nfvjN9M3yXmWLWrYvBC6sWzciIkZPvrkbEdEwCf6IiIZJ8EdENEyCPyKiYRL8ERENk+CPiGiYBH9E\nRMMk+CMiGibBHxHRMAn+iIiGSfBHRDRMgj8iomES/BERDZPgj4homAR/RETDJPgjIhomwR8R0TC1\ngl/SbEkbJG2UdGYfx0+WtE7S7ZJukXRky7HNpXytpNWdbHxERAxc21svShoHXAS8DtgCrJK0zPad\nLafdDRxn+wFJc4DFwNEtx4+3/YsOtjsiIgapzoh/JrDR9ibbTwCXA/NaT7B9i+0Hyu5K4JDONjMi\nIjqlTvBPAe5p2d9SyvrzTuCaln0DN0haI2lhf5UkLZS0WtLq7du312hWREQMRtupnoGQdDxV8B/b\nUnys7a2SDgSul3SX7RW969peTDVFRHd3tzvZroiI+K06I/6twKEt+4eUst8h6Qjgy8A82/f1lNve\nWn5uA66imjqKiIhRUif4VwHTJR0maQIwH1jWeoKkqcCVwCm2f9xSPlHSpJ5t4ATgjk41PiIiBq7t\nVI/tHZJOB64DxgFLbK+XdFo5vgg4CzgA+LwkgB22u4GDgKtK2R7AZbavHZaeRERELbXm+G0vB5b3\nKlvUsv0u4F191NsEHNm7PCIiRk++uRsR0TAJ/oiIhknwR0Q0TII/IqJhEvwREQ2T4I+IaJgEf0RE\nwyT4IyIaJsEfEdEwCf6IiIZJ8EdENEyCPyKiYRL8ERENk+CPiGiYBH9ERMMk+CMiGibBHxHRMLWC\nX9JsSRskbZR0Zh/HJemCcnydpJfVrRsRESOrbfBLGgdcBMwBZgALJM3oddocYHp5LAS+MIC6EREx\nguqM+GcCG21vsv0EcDkwr9c584BLXVkJ7C/p2TXrRkTECKpzs/UpwD0t+1uAo2ucM6VmXQAkLaR6\ntQDwiKQNNdrWl8nALwZZd9B03kg/4+8YlT6Psqb1uWn9hQb2WecNqc/PqXtineAfEbYXA4uHeh1J\nq213d6BJY0b6vPtrWn8hfR5OdYJ/K3Boy/4hpazOOeNr1I2IiBFUZ45/FTBd0mGSJgDzgWW9zlkG\nnFo+3XMM8KDte2vWjYiIEdR2xG97h6TTgeuAccAS2+slnVaOLwKWA3OBjcBjwNt3VndYevJbQ54u\nGoPS591f0/oL6fOwke2ReJ6IiNhF5Ju7ERENk+CPiGiYMRn8Q1lCYqyq0eeTS19vl3SLpCNHo52d\nVHe5D0mvkLRD0kkj2b7hUKfPkmZJWitpvaQbR7qNnVbj//Z+kq6W9MPS57ePRjs7RdISSdsk3dHP\n8eHPL9tj6kH1JvFPgOcCE4AfAjN6nTMXuAYQcAzw/dFu9wj0+VXAM8r2nCb0ueW871J9wOCk0W73\nCPw77w/cCUwt+weOdrtHoM8fBc4r213A/cCE0W77EPr8R8DLgDv6OT7s+TUWR/xDWUJirGrbZ9u3\n2H6g7K6k+s7EWFZ3uY/3AVcA20ayccOkTp//HLjS9k8BbI/1ftfps4FJkgTsQxX8O0a2mZ1jewVV\nH/oz7Pk1FoO/v+UhBnrOWDLQ/ryTasQwlrXts6QpwImURQF3A3X+nZ8PPEPSv0laI+nUEWvd8KjT\n5wuBFwH/DdwO/JXtp0ameaNi2PNrl1myITpD0vFUwX/saLdlBHwW+LDtp6rBYCPsAbwceA2wF3Cr\npJW2fzy6zRpWrwfWAn8MPA+4XtJNth8a3WaNXWMx+IeyhMRYVas/ko4AvgzMsX3fCLVtuNTpczdw\neQn9ycBcSTtsf31kmthxdfq8BbjP9qPAo5JWAEcCYzX46/T57cC5ribAN0q6G3ghcNvINHHEDXt+\njcWpnqEsITFWte2zpKnAlcApu8nor22fbR9me5rtacDXgPeM4dCHev+3vwEcK2kPSXtTrXb7oxFu\nZyfV6fNPqV7hIOkg4AXAphFt5cga9vwacyN+D2EJibGqZp/PAg4APl9GwDs8hlc2rNnn3UqdPtv+\nkaRrgXXAU8CXbff5scCxoOa/8yeAiyXdTvVJlw/bHrPLNUtaCswCJkvaApxNtaDliOVXlmyIiGiY\nsTjVExERQ5Dgj4homAR/RETDJPgjIhomwR8R0TAJ/ug4SU+W1SN/KOkHkl7V5vz9Jb1npNo33CSd\nIemu8jtYNdhlFSQdJWnuIOpN61n5UVK3pAvK9qx2/xbRDAn+GA6P2z7K9pHAR4Bz2py/P7BbBH/5\n/PnrgJm2j6L64tFg15M4iurz3H09T63v4Nhebfv9ZXcW1Squ0XAJ/hhu+wI9q4Yi6UNlFLxO0t+X\n4nOB55UR8vmSLpL0J+X8qyQtKdvvkPSpsv1WSbeVOl+UNK6UnyDp1vJK418l7VPKN0v6+1J+u6QX\nlvKJZX302yT9h6R5pfzwluuvkzS9nPut8krmDklv6aO/HwXe3bOOjO2HbF9SrvlySTeWxdWu61lx\nsSy4dl55vh9LenX5FuvHgbeUNrxF0sckfUXSzcBXysj+ptKnPl9ZlVH+NyVNA04DPliu92pJd0sa\nX87bt3U/dnOjvTZ1HrvfA3iSalGtu4AHgZeX8hOobiYtqkHHN6nWJp9Gy9rkVF/bP79s3wasLNv/\nRLVg14uAq4HxpfzzwKlU6/WsACaW8g8DZ5XtzcD7yvZ7qL7xCvBp4K1le3+qNW8mAp8DTi7lE6gW\nRHsz8KWWdu7Xq9/7Ag/08zsZD9wCdJX9t1B9SxXg34DPlO25wA1l+y+AC1uu8TFgDbBX2d8b2LNs\nTwdWl+3f/D6pRvnfbKl/Rsv1/gn407K9sKcNeez+jzG3ZEOMCY+7muZA0iuBSyW9mCr4TwD+o5y3\nD1Vg/bRX/ZuAD0iaQXXTkWeU0fErgfcDb6NaoXJVWZ5iL6r1+I8BZgA3l/IJwK0t172y/FwD/I+y\nfQLwJ5LOKPt7AlNLvb+VdAjV+vf/WZYM+Iyk86jC9KYB/E5eALyYamVJqJYnaF1/pbVt03ZynWW2\nHy/b44ELJR1F9cf2+QNoD1QL+v0N8HWqZQH+coD1Y4xK8Mewsn2rpMlUd04ScI7tL7aeU6YhWuts\nlbQ/MJtqBP9M4M+AR2w/rCo5L7H9kV7XeRNwve0F/TTn1+Xnk/z2/76AN9ve0OvcH0n6PvAGYLmk\n/2n7u6pugzcX+KSk79j+eEu7H5L0iKTn2u69iJiA9bZfOYC29eXRlu0PAj+nWp3zacCvdlLv99i+\nuUwXzQLGeQyv+RMDkzn+GFZlLn0ccB/VQlzvaJl3nyLpQOBhYFKvqiuBD1AF/03AGeUnwHeAk0pd\nJD1T0nNKnT+U9AelfKKkdqPg64D3lT8mSHpp+flcYJPtC6hWxDxC0sHAY7b/GTif6vZ5vZ0DXCRp\n33KdfVR9qmcD0FVeASFpvKTD27Str99Lq/2Ae13dlOQUqt/zQK93KXAZ1bRPNESCP4bDXuUNxLXA\nV4G32X7S9repQubWMm3yNWCSq3sH3FzeMD2/XOMmYA/bG4EfUI36bwKwfSfwd8C3Ja0DrgeebXs7\n1bz40lJ+K9W67TvzCaopk3WS1pd9qF5h3FH68GKqgHwJcFspOxv4ZB/X+wLwPappqDtKm59ydVvB\nk4DzJP2Q6j2Qdp+w+R4wo+fN3T6Ofx54W7neC/ndVwN9uRo4sefN3VL2L8AzgKVt6sZuJKtzRjSY\npJOAebZPGe22xMjJHH9EQ0n6HDCHfr4rELuvjPgjIhomc/wREQ2T4I+IaJgEf0REwyT4IyIaJsEf\nEdEw/x8ghjJoV24M9AAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x118bf3750>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Your soultion should Look somthing Like this \n",
    "\n",
    "def graph_data(graph):\n",
    "    \"\"\"\n",
    "    Creates histograms of the the Degree of Centrality and the Betweenness Centrality \n",
    "    \n",
    "    Parameters\n",
    "    ----------\n",
    "    graph - A Networkx object Graph. Graph nodes must have degree_centrality and betweenness attributes\n",
    "    \n",
    "    \"\"\"\n",
    "    # Create an empty list to hold all of our degree_centrality items  \n",
    "    cen_list = []\n",
    "    # Use the built in function get_node_attributes to collect the degree_centrality for each node\n",
    "    for item in networkx.get_node_attributes(graph, 'degree_centrality'):\n",
    "        cen_list.append(networkx.get_node_attributes(graph, 'degree_centrality')[item])\n",
    "    \n",
    "    # Pass the cen_list to a plt object and plot as a histogram \n",
    "    plt.figure(1)\n",
    "    #title\n",
    "    plt.title(\"Degree Centrality\")\n",
    "\n",
    "    #labels\n",
    "    plt.xlabel(\"Degree Centrality\")\n",
    "    \n",
    "    plt.hist(cen_list)\n",
    "    \n",
    "    # Create an empty list to hold all of our eigen_cent items \n",
    "    bw_list = []\n",
    "    # Use the built in function get_node_attributes to collect the eigen_cent for each node\n",
    "    for item in networkx.get_node_attributes(graph, 'betweenness'):\n",
    "        bw_list.append(networkx.get_node_attributes(graph, 'betweenness')[item])\n",
    "    \n",
    "    # Pass the eig_list to a plt object and plot as a histogram \n",
    "    plt.figure(2)\n",
    "    #title\n",
    "    plt.title(\"Betweeness Centrality\")\n",
    "\n",
    "    #labels\n",
    "    plt.xlabel(\"Betweeness Centrality\")\n",
    "    plt.hist(bw_list)\n",
    "\n",
    "    \n",
    "# Call the function graph_data() on our Networkx graph \n",
    "graph_data( subgraph_graph )\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of cliques: 2\n",
      "Size of cliques:[2, 2]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[(a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}),\n",
       "  (a43fe2c:Award {award_num:\"aw1468\"})],\n",
       " [(a21743e:Employee {employeeid:\"90024517\",position:\"FACULTY\"}),\n",
       "  (f6b7edd:Award {award_num:\"aw1257\"})]]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Call the fucntion find_cliques() on our Networkx graph \n",
    "find_cliques( subgraph_graph )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "celltoolbar": "Create Assignment",
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
